{"FactoryUIComponent":{"id":"FactoryUIComponent","title":"UIComponent","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"What is to be done by this control","composition":"What happens if the control is operated","effect":"What happens if the control is operated","rivals":{"Rival 1":"What other controls are similar, what is their distinction"}},"background":"Relevant academic information","context":["The context states where this control is used specifically (this list might not be complete) and how common is this control used"],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Where and when an element is to be used or not."},"composition":[],"interaction":{"2":"How the interaction with this object takes place."},"wording":{"3":"How the wording of labels or captions must be."},"ordering":{"5":"How different elements of this instance are to be ordered."},"style":{"4":"How this element should look like."},"responsiveness":{"6":"How this element behaves on changing screen sizes"},"accessibility":{"7":"How this element is made accessible"}},"parent":false,"children":["IconFactoryIcon","CounterFactoryCounter","ImageFactoryImage","DividerFactoryDivider","LinkFactoryLink","GlyphFactoryGlyph","ButtonFactoryButton","DropdownFactoryDropdown","BreadcrumbsBreadcrumbsBreadcrumbs","ViewControlFactoryViewControl","ChartFactoryChart","InputFactoryInput","CardFactoryCard","DeckDeckDeck","ListingFactoryListing","PanelFactoryPanel","ItemFactoryItem","ModalFactoryModal","PopoverFactoryPopover","DropzoneFactoryDropzone","LegacyLegacyLegacy","TableFactoryTable","MessageBoxFactoryMessageBox"],"less_variables":[],"path":"src\/UI\/Factory"},"IconFactoryIcon":{"id":"IconFactoryIcon","title":"Icon","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Icons are quickly comprehensible and recognizable graphics. They indicate the functionality or nature of a text-element or context: Icons will mainly be used in front of object-titles, e.g. in the header, the tree and in repository listing. Icons can be disabled. Disabled Icons visually communicate that the depicted functionality is not available for the intended audience.","composition":"Icons come in three fixed sizes: small, medium and large. They can be configured with an additional \"abbreviation\", a text of a few characters that will be rendered on top of the image. The Disabled Icons merely stand out visually: A color shade covers the Icon.","effect":"Icons themselves are not interactive; however they are allowed within interactive containers.","rivals":{"Glyph":"Glyphs are typographical characters that act as a trigger for some action.","Image":"Images belong to the content and can be purely decorative."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Icons MUST be used to represent objects or context.","2":"Icons MUST be used in combination with a title or label.","3":"An unique Icon MUST always refer to the same thing."},"composition":[],"interaction":[],"wording":{"1":"The aria-label MUST state the represented object-type.","2":"The abbreviation SHOULD consist of one or two letters."},"ordering":[],"style":{"1":"Icons MUST have a class indicating their usage.","2":"Icons MUST be tagged with a CSS-class indicating their size."},"responsiveness":[],"accessibility":{"1":"Icons MUST use aria-label.","2":"Disabled Icons MUST bear an aria-label indicating the special status."}},"parent":"FactoryUIComponent","children":["IconStandardStandard","IconCustomCustom"],"less_variables":[],"path":"src\/UI\/Component\/Icon\/Factory"},"CounterFactoryCounter":{"id":"CounterFactoryCounter","title":"Counter","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Counter inform users about the quantity of items indicated by a glyph.","composition":"Counters consist of a number and some background color and are placed one the 'end of the line' in reading direction of the item they state the count for.","effect":"Counters convey information, they are not interactive.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":["http:\/\/www.ilias.de\/docu\/goto_docu_wiki_wpage_3854_1357.html"],"rules":{"usage":{"1":"A counter MUST only be used in combination with a glyph."},"composition":{"1":"A counter MUST contain exactly one number greater than zero and no other characters."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"FactoryUIComponent","children":["CounterCounterStatus","CounterCounterNovelty"],"less_variables":[],"path":"src\/UI\/Component\/Counter\/Factory"},"ImageFactoryImage":{"id":"ImageFactoryImage","title":"Image","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Image component is used to display images of various sources.","composition":"An Image is composed of the image and an alternative text for screen readers.","effect":"Images may be included in interacted components but not interactive on their own.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"Images MUST contain the alt attribute. This attribute MAY be left empty (alt=\"\") if the image is of decorative nature. According to the WAI, decorative images don’t add information to the content of a page. For example, the information provided by the image might already be given using adjacent text, or the image might be included to make the website more visually attractive (see <a href=\"https:\/\/www.w3.org\/WAI\/tutorials\/images\/decorative\/\">https:\/\/www.w3.org\/WAI\/tutorials\/images\/decorative\/<\/a>)."}},"parent":"FactoryUIComponent","children":["ImageImageStandard","ImageImageResponsive"],"less_variables":[],"path":"src\/UI\/Component\/Image\/Factory"},"DividerFactoryDivider":{"id":"DividerFactoryDivider","title":"Divider","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A divider marks a thematic change in a sequence of other components. A Horizontal Divider is used to mark a thematic change in sequence of elements that are stacked from top to bottom, e.g. in a Dropdown. A Vertical Divider is used to mark a thematic change in a sequence of elements that are lined up from left to right, e.g. a Toolbar.","composition":"","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Dividers MUST only be used in container components that explicitly state and define the usage of Dividers within the container."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"FactoryUIComponent","children":["DividerHorizontalHorizontal","DividerVerticalVertical"],"less_variables":[],"path":"src\/UI\/Component\/Divider\/Factory"},"LinkFactoryLink":{"id":"LinkFactoryLink","title":"Link","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Links are used navigate to other resources or views of the system. Clicking on a link does not change the systems status.","composition":"Link is a clickable, graphically minimal obtrusive control element. It can bear text or other content. Links always contain a valid href tag which should not not just contain a hash sign.","effect":"On-click, the resource or view indicated by the link is requested and presented. Links are not used to trigger Javascript events.","rivals":{"buttons":"Buttons are used to trigger Interactions that usually change the systems status. Buttons are much more obtrusive than links and may fire JS events."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Links MAY be used inline in a Textual Paragraphs."},"composition":[],"interaction":{"1":"Hovering an active link should indicate a possible interaction.","2":"Links MUST not be used to fire Javascript events."},"wording":{"1":"The wording of the link SHOULD name the target view or resource."},"ordering":[],"style":{"1":"Links SHOULD not be presented with a separate background color."},"responsiveness":[],"accessibility":{"1":"DOM elements of type \"a\" MUST be used to properly identify an element."}},"parent":"FactoryUIComponent","children":["LinkStandardStandard"],"less_variables":[],"path":"src\/UI\/Component\/Link\/Factory"},"GlyphFactoryGlyph":{"id":"GlyphFactoryGlyph","title":"Glyph","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Glyphs map a generally known concept or symbol to a specific concept in ILIAS. Glyphs are used when space is scarce.","composition":"A glyph is a typographical character that represents something else. As any other typographical character, they can be manipulated by regular CSS. If hovered they change their background to indicate possible interactions.","effect":"Glyphs act as trigger for some action such as opening a certain Overlay type or as shortcut.","rivals":{"icon":"Standalone Icons are not interactive. Icons can be in an interactive container however. Icons merely serve as additional hint of the functionality described by some title. Glyphs are visually distinguished from object icons: they are monochrome."}},"background":"\"In typography, a glyph is an elemental symbol within an agreed set of symbols, intended to represent a readable character for the purposes of writing and thereby expressing thoughts, ideas and concepts.\" (https:\/\/en.wikipedia.org\/wiki\/Glyph) Lidwell states that such symbols are used \"to improve the recognition and recall of signs and controls\".","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Glyphs MUST NOT be used in content titles.","2":"Glyphs MUST be used for cross-sectional functionality such as mail for example and NOT for representing objects.","3":"Glyphs SHOULD be used for very simple tasks that are repeated at many places throughout the system.","4":"Services such as mail MAY be represented by a glyph AND an icon."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":{"1":"All Glyphs MUST be taken from the Bootstrap Glyphicon Halflings set. Exceptions MUST be approved by the JF."},"responsiveness":[],"accessibility":{"1":"The functionality triggered by the Glyph must be indicated to screen readers with by the attribute aria-label or aria-labelledby attribute."}},"parent":"FactoryUIComponent","children":["GlyphGlyphSettings","GlyphGlyphCollapse","GlyphGlyphExpand","GlyphGlyphAdd","GlyphGlyphRemove","GlyphGlyphUp","GlyphGlyphDown","GlyphGlyphBack","GlyphGlyphNext","GlyphGlyphSortAscending","GlyphGlyphSortDescending","GlyphGlyphBriefcase","GlyphGlyphUser","GlyphGlyphMail","GlyphGlyphNotification","GlyphGlyphTag","GlyphGlyphNote","GlyphGlyphComment","GlyphGlyphLike","GlyphGlyphLove","GlyphGlyphDislike","GlyphGlyphLaugh","GlyphGlyphAstounded","GlyphGlyphSad","GlyphGlyphAngry","GlyphGlyphEyeclosed","GlyphGlyphEyeopen","GlyphGlyphAttachment","GlyphGlyphReset","GlyphGlyphApply"],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Factory"},"ButtonFactoryButton":{"id":"ButtonFactoryButton","title":"Button","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Buttons trigger interactions that change the system’s or view's status. Acceptable changes to the current view are those that do not result in a complete replacement of the overall screen (e.g. modals).","composition":"Button is a clickable, graphically obtrusive control element. It can bear text.","effect":"On-click, the action indicated by the button is carried out.","rivals":{"glyph":"Glyphs are used if the enclosing Container Collection can not provide enough space for textual information or if such an information would clutter the screen.","links":"Links are used to trigger Interactions that do not change the systems status. They are usually contained inside a Navigational Collection."}},"background":"Wording rules have been inspired by the iOS Human Interface Guidelines (UI-Elements->Controls->System Button) Style rules have been inspired from the GNOME Human Interface Guidelines->Buttons.","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Buttons MUST NOT be used inside a Textual Paragraph."},"composition":[],"interaction":{"2":"If an action is temporarily not available, Buttons MUST be disabled by setting as type 'disabled'.","3":"A button MUST NOT be used for navigational purpose."},"wording":{"1":"The caption of a Button SHOULD contain no more than two words.","2":"The wording of the button SHOULD describe the action the button performs by using a verb or a verb phrase.","3":"Every word except articles, coordinating conjunctions and prepositions of four or fewer letters MUST be capitalized.","4":"For standard events such as saving or canceling the existing standard terms MUST be used if possible: Save, Cancel, Delete, Cut, Copy.","5":"There are cases where a non-standard label such as “Send Mail” for saving and sending the input of a specific form might deviate from the standard. These cases MUST however specifically justified."},"ordering":[],"style":{"1":"If Text is used inside a Button, the Button MUST be at least six characters wide."},"responsiveness":[],"accessibility":{"1":"DOM elements of type \"button\" MUST be used to properly identify an element as a Button if there is no good reason to do otherwise.","2":"Button DOM elements MUST either be of type \"button\", of type \"a\" accompanied with the aria-role “Button” or input along with the type attribute “button” or \"submit\"."}},"parent":"FactoryUIComponent","children":["ButtonStandardStandard","ButtonPrimaryPrimary","ButtonCloseClose","ButtonShyShy","ButtonMonthMonth","ButtonTagTag","ButtonBulkyBulky","ButtonToggleToggle"],"less_variables":[],"path":"src\/UI\/Component\/Button\/Factory"},"DropdownFactoryDropdown":{"id":"DropdownFactoryDropdown","title":"Dropdown","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Dropdowns reveal a list of interactions that change the system’s status or navigate to a different view.","composition":"Dropdown is a clickable, graphically obtrusive control element. It can bear text. On-click a list of Shy Buttons and optional Dividers is shown. Note that empty dropdowns are not rendered at all to keep the UI as clean as possible.","effect":"On-click, a list of actions is revealed. Clicking an item will trigger the action indicated. Clicking outside of an opened Dropdown will close the list of items.","rivals":{"button":"Buttons are used, if single actions should be presented directly in the user interface.","links":"Links are used to trigger actions that do not change the systems status. They are usually contained inside a Navigational Collection.","popovers":"Dropdowns only provide a list of possible actions. Popovers can include more diverse and flexible content."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Dropdowns MUST NOT be used standalone. They are only parts of more complex UI elements. These elements MUST define their use of Dropdown. E.g. a List or a Table MAY define that a certain kind of Dropdown is used as part of the UI element."},"composition":{"1":"Empty dropdowns MUST NOT be rendered at all to keep the UI as clean as possible."},"interaction":{"1":"Only Dropdown Items MUST trigger an action or change a view. The Dropdown trigger element is only used to show and hide the list of Dropdown Items."},"wording":{"1":"The label of a Dropdown SHOULD contain no more than two words.","2":"Every word except articles, coordinating conjunctions and prepositions of four or fewer letters MUST be capitalized.","3":"For standard events such as saving or canceling the existing standard terms MUST be used if possible: Delete, Cut, Copy.","4":"There are cases where a non-standard label such as “Send Mail” for saving and sending the input of a specific form might deviate from the standard. These cases MUST however specifically justified."},"ordering":[],"style":{"1":"If Text is used inside a Dropdown label, the Dropdown MUST be at least six characters wide."},"responsiveness":[],"accessibility":{"1":"DOM elements of type \"button\" MUST be used to properly identify an element as a Dropdown.","2":"Dropdown items MUST be implemented as \"ul\" list with a set of \"li\" elements and nested Shy Button elements for the actions.","3":"Triggers of Dropdowns MUST indicate their effect by the aria-haspopup attribute set to true.","4":"Triggers of Dropdowns MUST indicate the current state of the Dropdown by the aria-expanded label.","5":"Dropdowns MUST be accessible by keyboard by focusing the trigger element and clicking the return key.","6":"Entries in a Dropdown MUST be accessible by the tab-key if opened.","7":"The focus MAY leave the Dropdown if tab is pressed while focusing the last element. This differs from the behaviour in Popovers and Modals.","8":"Dropdowns MUST set the aria-label describing the contained options, if the term \"Actions\" does not describe the contained options well."}},"parent":"FactoryUIComponent","children":["DropdownStandardStandard"],"less_variables":[],"path":"src\/UI\/Component\/Dropdown\/Factory"},"BreadcrumbsBreadcrumbsBreadcrumbs":{"id":"BreadcrumbsBreadcrumbsBreadcrumbs","title":"Breadcrumbs","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Breadcrumbs is a supplemental navigation scheme. It eases the user's navigation to higher items in hierarchical structures. Breadcrumbs also serve as an effective visual aid indicating the user's location on a website.","composition":"Breadcrumbs-entries are rendered as horizontally arranged UI Links with a seperator in-between.","effect":"Clicking on an entry will get the user to the respective location.","rivals":[]},"background":"","context":["Suplemental navigation under the main menu","Location hint in search results","Path to current location on info page"],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Crumbs MUST trigger navigation to other resources of the system."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"FactoryUIComponent","children":[],"less_variables":[],"path":"src\/UI\/Component\/Breadcrumbs\/Breadcrumbs"},"ViewControlFactoryViewControl":{"id":"ViewControlFactoryViewControl","title":"View Control","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"View Controls switch between different visualisation of data.","composition":"View Controls are composed mainly of buttons, they are often found in toolbars.","effect":"Interacting with a view control changes to display in some content area.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":null,"parent":"FactoryUIComponent","children":["ViewControlModeMode","ViewControlSectionSection","ViewControlSortationSortation","ViewControlPaginationPagination"],"less_variables":[],"path":"src\/UI\/Component\/ViewControl\/Factory"},"ChartFactoryChart":{"id":"ChartFactoryChart","title":"Chart","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Charts are used to graphically represent data in various forms such as maps, graphs or diagrams.","composition":"Charts are composed of various graphical and textual elements representing the raw data.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":[],"interaction":[],"wording":[],"ordering":[],"style":{"1":"Charts SHOULD not rely on colors to convey information."},"responsiveness":[],"accessibility":[]},"parent":"FactoryUIComponent","children":["ChartScaleBarScaleBar","ChartProgressMeterFactoryProgressMeter"],"less_variables":[],"path":"src\/UI\/Component\/Chart\/Factory"},"InputFactoryInput":{"id":"InputFactoryInput","title":"Input","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"In opposite to components with a purely receptive or at most navigational character, input elements are used to relay user-induced data to the system.","composition":"An input consists of fields that define the way data is entered and a container around those fields that defines the way the data is submitted to the system.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":null,"parent":"FactoryUIComponent","children":["InputFieldFactoryField","InputContainerFactoryContainer"],"less_variables":[],"path":"src\/UI\/Component\/Input\/Factory"},"CardFactoryCard":{"id":"CardFactoryCard","title":"Card","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A card is a flexible content container for small chunks of structured data. Cards are often used in so-called Decks which are a gallery of Cards.","composition":"Cards contain a header, which often includes an Image or Icon and a Title as well as possible actions as Default Buttons and 0 to n sections that may contain further textual descriptions, links and buttons. The size of the cards in decks may be set to extra small (12 cards per row), small (6 cards per row, default), medium (4 cards per row), large (3 cards per row), extra large (2 cards per row) and full (1 card per row). The number of cards per row is responsively adapted, if the size of the screen is changed.","effect":"Cards may contain Interaction Triggers.","rivals":{"Heading Panel":"Heading Panels fill up the complete available width in the Center Content Section. Multiple Heading Panels are stacked vertically.","Block Panels":"Block Panels are used in Sidebars"}},"background":"","context":[],"selector":"","feature_wiki_references ":["http:\/\/www.ilias.de\/docu\/goto_docu_wiki_wpage_3208_1357.html"],"rules":{"usage":[],"composition":{"1":"Cards MUST contain a title.","2":"Cards SHOULD contain an Image or Icon in the header section.","3":"Cards MAY contain Interaction Triggers."},"interaction":[],"wording":[],"ordering":[],"style":{"1":"Sections of  Cards MUST be separated by Dividers."},"responsiveness":[],"accessibility":{"1":"If multiple Cards are used, they MUST be contained in a Deck."}},"parent":"FactoryUIComponent","children":["CardStandardStandard","CardRepositoryObjectRepositoryObject"],"less_variables":[],"path":"src\/UI\/Component\/Card\/Factory"},"DeckDeckDeck":{"id":"DeckDeckDeck","title":"Deck","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Decks are used to display multiple Cards in a grid. They should be used if a  page contains many content items that have similar style and importance. A Deck gives each item equal horizontal space indicating that they are of equal importance.","composition":"Decks are composed only of Cards arranged in a grid. The cards displayed by decks are all of equal size. This Size ranges very small (XS) to very large (XL).","effect":"The Deck is a mere scaffolding element, is has no effect.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":["http:\/\/www.ilias.de\/docu\/goto_docu_wiki_wpage_3992_1357.html"],"rules":{"usage":{"1":"Decks MUST only be used to display multiple Cards."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":{"1":"The number of cards displayed per row MUST adapt to the screen size."},"responsiveness":[],"accessibility":[]},"parent":"FactoryUIComponent","children":[],"less_variables":[],"path":"src\/UI\/Component\/Deck\/Deck"},"ListingFactoryListing":{"id":"ListingFactoryListing","title":"Listing","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Listings are used to structure itemised textual information.","composition":"Listings may contain ordered, unordered, or labeled items.","effect":"Listings hold only textual information. They may contain Links but no Buttons.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"Listings MUST NOT contain Buttons."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"FactoryUIComponent","children":["ListingUnorderedUnordered","ListingOrderedOrdered","ListingDescriptiveDescriptive","ListingWorkflowFactoryWorkflow"],"less_variables":[],"path":"src\/UI\/Component\/Listing\/Factory"},"PanelFactoryPanel":{"id":"PanelFactoryPanel","title":"Panel","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Panels are used to group titled content.","composition":"Panels consist of a header and content section. They form one Gestalt and so build a perceivable cluster of information. Additionally an optional Dropdown that offers actions on the entity being represented by the panel is shown at the top of the Panel.","effect":"The effect of interaction with panels heavily depends on their content.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":[],"interaction":[],"wording":{"1":"Panels MUST contain a title."},"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"FactoryUIComponent","children":["PanelStandardStandard","PanelSubSub","PanelReportReport","PanelListingFactoryListing"],"less_variables":[],"path":"src\/UI\/Component\/Panel\/Factory"},"ItemFactoryItem":{"id":"ItemFactoryItem","title":"Item","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"An item displays a unique entity within the system. It shows information about that entity in a structured way.","composition":"Items contain the name of the entity as a title. The title MAY be interactive by using a Shy Button. The item contains three sections, where one section contains important information about the item, the second section shows the content of the item and another section shows metadata about the entity.","effect":"Items may contain Interaction Triggers such as Glyphs, Buttons or Tags.","rivals":{"Card":"Cards define the look of items in a deck. Todo: We need to refactor cards."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"Items MUST contain the name of the displayed entity as a title.","2":"Items SHOULD contain a section with it's content.","3":"Items MAY contain Interaction Triggers.","4":"Items MAY contain a section with metadata."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"FactoryUIComponent","children":["ItemStandardStandard","ItemGroupGroup"],"less_variables":[],"path":"src\/UI\/Component\/Item\/Factory"},"ModalFactoryModal":{"id":"ModalFactoryModal","title":"Modal","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Modal forces users to focus on the task at hand.","composition":"A Modal is a full-screen dialog on top of the greyed-out ILIAS screen. The Modal consists of a header with a close button and a typography modal title, a content section and might have a footer.","effect":"All controls of the original context are inaccessible until the Modal is completed. Upon completion the user returns to the original context.","rivals":{"Popover":"Modals have some relations to popovers. The main difference between the two is the disruptive nature of the Modal and the larger amount of data that might be displayed inside a modal. Also popovers perform mostly action to add or consult metadata of an item while Modals manipulate or focus items or their sub-items directly."}},"background":"http:\/\/quince.infragistics.com\/Patterns\/Modal%20Panel.aspx","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"The main purpose of the Modals MUST NOT be navigational. But Modals MAY be dialogue of one or two steps and thus encompass \"next\"-buttons  or the like.","2":"Modals MUST NOT contain other modals (Modal in Modal).","3":"Modals SHOULD not be used to perform complex workflows.","4":"Modals MUST be closable by a little “x”-button on the right side of the header.","5":"Modals MUST contain a title in the header."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"FactoryUIComponent","children":["ModalInterruptiveInterruptive","InterruptiveItemInterruptiveItem","ModalRoundTripRoundtrip","ModalLightboxLightbox","LightboxImagePageLightboxImagePage","LightboxTextPageLightboxTextPage"],"less_variables":[],"path":"src\/UI\/Component\/Modal\/Factory"},"PopoverFactoryPopover":{"id":"PopoverFactoryPopover","title":"Popover","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Popovers can be used when space is scarce i.e. within List GUI items, table cells or menus in the Header section. They offer either secondary information on object like a preview or rating to be displayed or entered. They display information about ongoing processes","composition":"Popovers consist of a layer displayed above all other content. The content of the Popover depends on the functionality it performs. A Popover MAY display a title above its content. All Popovers contain a pointer pointing from the Popover to the Triggerer of the Popover.","effect":"Popovers are shown by clicking a Triggerer component such as a Button or Glyph. The position of the Popover is calculated automatically be default. However, it is possible to specify if the popover appears horizontal (left, right) or vertical (top, bottom) relative to its Triggerer component. Popovers disappear by clicking anywhere outside the Popover or by pressing the ESC key.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Popovers MUST NOT contain horizontal scrollbars.","2":"Popovers MAY contain vertical scrollbars. The content component is responsible to define its own height and show vertical scrollbars.","3":"If Popovers are used to present secondary information of an object, they SHOULD display a title representing the object."},"composition":[],"interaction":{"1":"A Popover MUST only be displayed if the Trigger component is clicked. This behaviour is different from Tooltips that appear on hovering. Popovers disappear by clicking anywhere outside the Popover or by pressing the ESC key."},"wording":[],"ordering":[],"style":{"1":"Popovers MUST always relate to the Trigger component by a little pointer."},"responsiveness":[],"accessibility":{"1":"There MUST be a way to open the Popover by only using the keyboard.","2":"The focus MUST be inside the Popover, once it is open if it contains at least one interactive item. Otherwise the focus MUST remain on the Triggerer component.","3":"The focus MUST NOT leave the Popover for as long as it is open.","4":"There MUST be a way to reach every control in the Popover by only using the keyboard.","5":"The Popover MUST be closable by pressing the ESC key.","6":"Once the Popover is closed, the focus MUST return to the element triggering the opening of the Popover or the element being clicked if the Popover was closed on click."}},"parent":"FactoryUIComponent","children":["PopoverStandardStandard","PopoverListingListing"],"less_variables":[],"path":"src\/UI\/Component\/Popover\/Factory"},"DropzoneFactoryDropzone":{"id":"DropzoneFactoryDropzone","title":"Dropzone","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Dropzones are containers used to drop either files or other HTML elements.","composition":"A dropzone is a container on the page. Depending on the type of the dropzone, the container is visible by default or it gets highlighted once the user starts to drag the elements over the browser window.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Dropzones MUST be highlighted if the user is dragging compatible elements inside or over the browser window."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"FactoryUIComponent","children":["DropzoneFileFactoryFile"],"less_variables":[],"path":"src\/UI\/Component\/Dropzone\/Factory"},"LegacyLegacyLegacy":{"id":"LegacyLegacyLegacy","title":"Legacy","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"This component is used to wrap an existing ILIAS UI element into a UI component. This is useful if a container of the UI components needs to contain content that is not yet implement in the centralized UI components.","composition":"The legacy component contains html or any other content as string.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"This component MUST only be used to ensure backwards compatibility with existing UI elements in ILIAS, therefore it SHOULD only contain Elements which cannot be generated using other UI Components from the UI Service."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"FactoryUIComponent","children":[],"less_variables":[],"path":"src\/UI\/Component\/Legacy\/Legacy"},"TableFactoryTable":{"id":"TableFactoryTable","title":"Table","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Tables present a set of uniformly structured data.","composition":"","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":null,"parent":"FactoryUIComponent","children":["TablePresentationPresentation"],"less_variables":[],"path":"src\/UI\/Component\/Table\/Factory"},"MessageBoxFactoryMessageBox":{"id":"MessageBoxFactoryMessageBox","title":"Message Box","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Message Boxes inform the user about the state of the system or an ongoing user task. Such as the successful completion, the need for further input  of an actual error or stopping users in their tracks in high-risk tasks.","composition":"Message Boxes consist of a mandatory message text, optional Buttons and an optional Unordered List of Links. There are four main types of Message Boxes, each is displayed in the according color: 1. Failure, 2. Success, 3. Info, 4. Confirmation","effect":"Message Boxes convey information and optionally provide interaction by using Buttons and navigation by using Links.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":[],"interaction":{"1":"In general Message Boxes MAY provide interaction by using Buttons. Only Confirmation Message Boxes MUST provide interaction by using Buttons.","2":"Navigation to other screens MUST by done by using Links."},"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"FactoryUIComponent","children":["MessageBoxMessageBoxFailure","MessageBoxMessageBoxSuccess","MessageBoxMessageBoxInfo","MessageBoxMessageBoxConfirmation"],"less_variables":[],"path":"src\/UI\/Component\/MessageBox\/Factory"},"IconStandardStandard":{"id":"IconStandardStandard","title":"Standard","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Standard Icons represent ILIAS Objects. In their outlined version, they are used to be layered upon a picture or if the Standard Icon should not catch too much of the users attention.","composition":"A Standard Icon is displayed as a block-element with a background-graphic. By default, a fallback icon will be rendered; this is until a background image is defined in the icon's CSS-class. The outlined version is the silhouette of the Standard Icon. This outlined version therefore attracts less attention.","effect":"","rivals":{"Custom Icon":"Custom Icons are constructed with a path to an (uploaded) image."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"If they are layered upon a picture, the outlined version MUST be used.","2":"In any other case, the non-outlined version SHOULD be used except for scenarios where the icon should not draw too much attention."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":{"1":"CSS-Filters MAY be used for Standard Icons in their outlined version to manipulate the stroke to fit the context.","2":"In their outlined version, Standard Icons MUST only use white as color for the stroke, to make filter easily applicable."},"responsiveness":[],"accessibility":{"1":"Icons MUST have aria-labels."}},"parent":"IconFactoryIcon","children":[],"less_variables":[],"path":"src\/UI\/Component\/Icon\/Standard"},"IconCustomCustom":{"id":"IconCustomCustom","title":"Custom","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"ILIAS allows users to upload icons for repository objects. Those, in opposite to the standard icons, need to be constructed with a path.","composition":"Instead of setting a background image via CSS-class, an image-tag is contained in the icons's div.","effect":"","rivals":{"Standard Icon":"Standard Icons MUST be used for core-objects."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Custom Icons MAY still use an abbreviation."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":{"1":"Custom Icons MUST use SVG as graphic.","2":"Icons MUST have a transparent background so they could be put on all kinds of backgrounds.","3":"Images used for Custom Icons SHOULD have equal width and height (=be quadratic) in order not to be distorted."},"responsiveness":[],"accessibility":[]},"parent":"IconFactoryIcon","children":[],"less_variables":[],"path":"src\/UI\/Component\/Icon\/Custom"},"CounterCounterStatus":{"id":"CounterCounterStatus","title":"Status","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Status counter is used to display information about the total number of some items like users active on the system or total number of comments.","composition":"The Status Counter is a non-obstrusive Counter.","effect":"Status Counters convey information, they are not interactive.","rivals":[]},"background":"","context":["The Status Counter is used in the ‘Who is online?’ Tool."],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":[],"interaction":[],"wording":[],"ordering":[],"style":{"1":"The Status Counter MUST be displayed on the lower right of the item it accompanies.","2":"The Status Counter SHOULD have a non-obstrusive background color, such as grey."},"responsiveness":[],"accessibility":[]},"parent":"CounterFactoryCounter","children":[],"less_variables":[],"path":"src\/UI\/Component\/Counter\/Counter"},"CounterCounterNovelty":{"id":"CounterCounterNovelty","title":"Novelty","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Novelty counters inform users about the arrival or creation of new items of the kind indicated by the accompanying glyph.","composition":"A Novelty Counter is an obtrusive counter.","effect":"They count down \/ disappear as soon as the change has been consulted by the user.","rivals":[]},"background":"","context":["Novelty Counters are found in the Mail in the Top Navigation.","Novelty Counters indicate new Comments."],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"The Novelty Counter MAY be used with the Status Counter."},"composition":[],"interaction":{"2":"There MUST be a way for the user to consult the changes indicated by the counter.","3":"After the consultation, the Novelty Counter SHOULD disappear or the number it contains is reduced by one.","4":"Depending on the content, the reduced number MAY be added in an additional Status Counter."},"wording":[],"ordering":[],"style":{"5":"The Novelty Counter MUST be displayed on the top at the 'end of the line' in reading direction of the item it accompanies. This would be top right for latin script and top left for arabic script.","6":"The Novelty Counter SHOULD have an obstrusive background color, such as red or orange."},"responsiveness":[],"accessibility":[]},"parent":"CounterFactoryCounter","children":[],"less_variables":[],"path":"src\/UI\/Component\/Counter\/Counter"},"ImageImageStandard":{"id":"ImageImageStandard","title":"Standard","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The standard image is used if the image is to be rendered in it's the original size.","composition":"","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":null,"parent":"ImageFactoryImage","children":[],"less_variables":[],"path":"src\/UI\/Component\/Image\/Image"},"ImageImageResponsive":{"id":"ImageImageResponsive","title":"Responsive","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A responsive image is to be used if the image needs to adapt to changing amount of space available.","composition":"Responsive images scale nicely to the parent element.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":null,"parent":"ImageFactoryImage","children":[],"less_variables":[],"path":"src\/UI\/Component\/Image\/Image"},"DividerHorizontalHorizontal":{"id":"DividerHorizontalHorizontal","title":"Horizontal","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A Horizontal Divider is used to mark a thematic change in a sequence of elements that are stacked from top to bottom.","composition":"Horizontal dividers consists of a horizontal line which may comprise a label.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Horizontal Dividers MUST only be used in container components that render a sequence of items from top to bottom."},"composition":[],"interaction":[],"wording":[],"ordering":{"1":"Horizontal Dividers MUST always have a succeeding element in a sequence of elments, which MUST NOT be another Horizontal Divider.","2":"Horizontal Dividers without label MUST always have a preceding element in a sequence of elments, which MUST NOT be another Horizontal Divider."},"style":[],"responsiveness":[],"accessibility":[]},"parent":"DividerFactoryDivider","children":[],"less_variables":[],"path":"src\/UI\/Component\/Divider\/Horizontal"},"DividerVerticalVertical":{"id":"DividerVerticalVertical","title":"Vertical","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A Vertical Divider is used to mark a thematic or functional change in a sequence of elements that are stacked from left to right.","composition":"Vertical Dividers consists of a glyph-like character.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Vertical Dividers MUST only be used in container components that render a sequence of items from left to right."},"composition":[],"interaction":[],"wording":[],"ordering":{"1":"Vertical Dividers MUST always have a succeeding element in a sequence of elments, which MUST NOT be another Vertical Divider."},"style":[],"responsiveness":[],"accessibility":[]},"parent":"DividerFactoryDivider","children":[],"less_variables":[],"path":"src\/UI\/Component\/Divider\/Vertical"},"LinkStandardStandard":{"id":"LinkStandardStandard","title":"Standard","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A standard link is a link with a text label as content of the link.","composition":"The standard link uses the default link color as text color an no background.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Standard links MUST be used if there is no good reason using another instance.","2":"Links to ILIAS screens that contain the general ILIAS navigation MUST NOT be opened in a new viewport."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"LinkFactoryLink","children":[],"less_variables":[],"path":"src\/UI\/Component\/Link\/Standard"},"GlyphGlyphSettings":{"id":"GlyphGlyphSettings","title":"Settings","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Settings Glyph triggers opening a Dropdown to edit settings of the displayed block.","composition":"The Settings Glyph uses the glyphicon-cog.","effect":"Upon clicking a settings Dropdown is opened.","rivals":[]},"background":"","context":["Adding answer options or taxonomies in questions-editing forms in tests.","Adding events to the calendar."],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"The Settings Glyph MUST only be used in Blocks."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be “Settings”."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphCollapse":{"id":"GlyphGlyphCollapse","title":"Collapse","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Collapse Glyph is used to trigger the collapsing of some neighbouring Container Collection such as a the content of a Dropdown or an Accordion currently shown.","composition":"The Collapse Glyph is composed of a triangle pointing to the bottom indicating that content is currently shown.","effect":"Clicking the Collapse Glyph hides the display of some Container Collection.","rivals":{"Expand Glyph":"The Expand Glyphs triggers the display of some Container Collection.","Previous Glyph":"The Previous\/Next Glyph opens a completely new view. It serves a navigational purpose."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"The Collapse Glyph MUST indicate if the toggled Container Collection is visible or not."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be ‘Collapse Content'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphExpand":{"id":"GlyphGlyphExpand","title":"Expand","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Expand Glyph is used to trigger the display of some neighbouring Container Collection such as a the content of a Dropdown or an Accordion currently shown.","composition":"The Expand Glyph is composed of a triangle pointing to the right indicating that content is currently shown.","effect":"Clicking the Expand Glyph displays some Container Collection.","rivals":{"Collapse Glyph":"The Collapse Glyphs hides the display of some Container Collection.","Previous Glyph":"The Previous\/Next Glyph opens a completely new view. It serves a navigational purpose."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"The Expand Glyph MUST indicate if the toggled Container Collection is visible or not."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be ‘Expand Content'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphAdd":{"id":"GlyphGlyphAdd","title":"Add","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The glyphed add-button serves as stand-in for the respective textual buttons in very crowded screens. It allows adding a new item.","composition":"The Add Glyph uses the glyphicon-plus-sign.","effect":"Clicking on the Add Glyph adds a new input to a form or an event to the calendar.","rivals":[]},"background":"","context":["Adding answer options or taxonomies in questions-editing forms in tests.","Adding events to the calendar."],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"The Add Glyph SHOULD not come without a Remove Glyph and vice versa. Because either there is not enough place for textual buttons or there is place. Exceptions to this rule, such as the Calendar, where only elements can be added in a certain place are possible, are to be run through the Jour Fixe.","2":"The Add Glyph stands for an Action and SHOULD be placed in the action column of a form.","3":"The Add Glyph MUST not be used to add lines to tables."},"composition":[],"interaction":{"1":"Newly added items MUST be placed below the line in which the Add Glyph has been clicked"},"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be ‘Add'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphRemove":{"id":"GlyphGlyphRemove","title":"Remove","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Remove Glyph serves as stand-in for the respective textual buttons in very crowded screens. It allows removing an item.","composition":"The Remove Glyph uses the glyphicon-plus-sign.","effect":"Clicking on the Remove Glyph adds a new input to a form or an event to the calendar.","rivals":[]},"background":"","context":["Removing answer options or taxonomies in questions-editing forms in tests.","Removing events to the calendar."],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"The Remove Glyph SHOULD not come without a glyphed Add Glyph and vice versa. Because either there is not enough place for textual buttons or there is place. Exceptions to this rule, such as the Calendar, where only elements can be added in a certain place are possible, are to be run through the Jour Fixe.","2":"The Remove Glyph stands for an Action and SHOULD be placed in the action column of a form.","3":"The Remove Glyph MUST not be used to add lines to tables."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be ‘Remove'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphUp":{"id":"GlyphGlyphUp","title":"Up","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Up Glyph allows for manually arranging rows in tables embedded in forms. It allows moving an item up.","composition":"The Up Glyph uses the glyphicon-circle-arrow-up. The Up Glyph can be combined with the Add\/Remove Glyph.","effect":"Clicking on the Up Glyph moves an item up.","rivals":[]},"background":"","context":["Moving answers up in Survey matrix questions."],"selector":"","feature_wiki_references ":["http:\/\/www.ilias.de\/docu\/goto_docu_wiki_wpage_813_1357.html"],"rules":{"usage":{"1":"The Up Glyph MUST NOT be used to sort tables. There is an established sorting control for that.","2":"The Up Glyph SHOULD not come without a Down and vice versa.","3":"The Up Glyph is an action and SHOULD be listed in the action column of a form."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be ‘Up'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphDown":{"id":"GlyphGlyphDown","title":"Down","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Down Glyph allows for manually arranging rows in tables embedded in forms. It allows moving an item down.","composition":"The Down Glyph uses the glyphicon-circle-arrow-down. The Down Glyph can be combined with the Add\/Remove Glyph.","effect":"Clicking on the Down Glyph moves an item up.","rivals":[]},"background":"","context":["Moving answers up in Survey matrix questions."],"selector":"","feature_wiki_references ":["http:\/\/www.ilias.de\/docu\/goto_docu_wiki_wpage_813_1357.html"],"rules":{"usage":{"1":"The Down Glyph MUST NOT be used to sort tables. There is an established sorting control for that.","2":"The Down Glyph SHOULD not come without a Up and vice versa.","3":"The Down Glyph is an action and SHOULD be listed in the action column of a form."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be ‘Down'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphBack":{"id":"GlyphGlyphBack","title":"Back","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Back Glyph indicates a possible change of the view. The view change leads back to some previous view.","composition":"The chevron-left glyphicon is used.","effect":"The click on a Back Glyph leads back to a previous view.","rivals":[]},"background":"","context":["Show Member View in courses."],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Back and Next Buttons MUST be accompanied by the respective Back\/Next Glyph."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":{"1":"If clicking on the Back\/Next GLYPH opens a new view of an object, the Next Glyph MUST be used.","2":"If clicking on the Back\/Next GLYPH opens a previous view of an object, the Back Glyph MUST be used."},"responsiveness":[],"accessibility":{"1":"The aria-label MUST be ‘Back'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphNext":{"id":"GlyphGlyphNext","title":"Next","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Next Glyph indicates a possible change of the view. The view change leads back to some previous view.","composition":"The chevron-right glyphicon is used.","effect":"The click on a Next Glyph opens a new view.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Back and Next Buttons MUST be accompanied by the respective Back\/Next Glyph."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":{"1":"If clicking on the Back\/Next GLYPH opens a new view of an object, the Next Glyph MUST be used.","2":"If clicking on the Back\/Next GLYPH opens a previous view of an object, the Back Glyph MUST be used."},"responsiveness":[],"accessibility":{"1":"The aria-label MUST be ‘Next'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphSortAscending":{"id":"GlyphGlyphSortAscending","title":"Sort Ascending","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Sorting Glyphs indicate the sorting direction of a column in a table as ascending (up) or descending (down). It is a toggle reversing the ordering of a column.","composition":"The Sort Ascending Glyph uses glyphicon-arrow-up.","effect":"Clicking the Sort Ascending Glyph reverses the direction of ordering in a table.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be ‘Sort Ascending'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphSortDescending":{"id":"GlyphGlyphSortDescending","title":"Sort Descending","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Sorting Glyphs indicate the sorting direction of a column in a table as ascending (up) or descending (down). It is a toggle reversing the ordering of a column.","composition":"The Sort Descending Glyph uses glyphicon-arrow-descending.","effect":"Clicking the Sort Descending Glyph reverses the direction of ordering in a table.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be ‘Sort Descending'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphBriefcase":{"id":"GlyphGlyphBriefcase","title":"Briefcase","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The briefcase symbolize some ongoing work that is done. Momentarily in the background tasks.","composition":"The briefcase Glyph uses glyphicon-briefcase.","effect":"The click on the briefcase opens a popup to the background tasks.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be ‘Background Tasks'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphUser":{"id":"GlyphGlyphUser","title":"User","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The User Glyph triggers the “Who is online?” Popover in the Top Navigation. The User Glyph indicates the number of pending contact requests and users online via the the Novelty Counter and Status Counter respectively.","composition":"The User Glyph uses the glyphicon-user.","effect":"Clicking the User Glyph opens the “Who is online?” Popover.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be ‘Show who is online'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphMail":{"id":"GlyphGlyphMail","title":"Mail","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Mail Glyph provides a shortcut to the mail service. The Mail Glyph indicates the number of new mails received.","composition":"The Mail Glyph uses the glyphicon-envelope.","effect":"Upon clicking on the Mail Glyph the user is transferred to the full-screen mail service.","rivals":{"Mail Icon":"The Mail Icon is used to indicate the user is currently located in the Mail service The Mail Glyph acts as shortcut to the Mail service."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be ‘Mail'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphNotification":{"id":"GlyphGlyphNotification","title":"Notification","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Notification Glyph allows users to activate \/ deactivate the notification service for a specific object or sub-item. It is a toggle indicating by colour  whether it is activated or not.","composition":"The Notification Glyph uses the glyphicon-bell in link-color if notifications are not active or brand-warning color if they are.","effect":"Upon clicking the notification activation is toggled: Clicking the Notification Glyph activates respectively deactivates the notification service for the current object or sub-item.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"The Notification Glyph MUST only be used in the Content Top Actions."},"composition":[],"interaction":{"1":"Clicking the Notification Glyph MUST toggle the activation of Notifications."},"wording":[],"ordering":[],"style":{"1":"If notifications are activated the Notification Glyph MUST use the brand-warning color."},"responsiveness":[],"accessibility":{"1":"The aria-label MUST be ‘Notifications'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphTag":{"id":"GlyphGlyphTag","title":"Tag","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Tag Glyph is used to indicate the possibility of adding tags to an object.","composition":"The Tag Glyph uses the glyphicon-tag.","effect":"Upon clicking the Round Trip Modal to add new Tags is opened.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"Novelty and Status Counter MUST show the amount of tags that has been given for an specific object."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be ‘Tags'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphNote":{"id":"GlyphGlyphNote","title":"Note","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Note Glyph is used to indicate the possibilty of adding notes to an object.","composition":"The Note Glyph uses the glyphicon-pushpin.","effect":"Upon clicking the Round Trip Modal to add new notes is opened","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"Novelty and Status Counter MUST show the amount of notes that has been given for an specific object."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be ‘Notes'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphComment":{"id":"GlyphGlyphComment","title":"Comment","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Comment Glyph is used to indicate the possibilty of adding comments to an object.","composition":"The Comment Glyph uses the glyphicon-comment.","effect":"Upon clicking the Round Trip Modal to add new comments is opened.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"Novelty and Status Counter MUST show the amount of comments that has been given for an specific object."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be ‘Comments'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphLike":{"id":"GlyphGlyphLike","title":"Like","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Clicking the Like Glyph indicates a user affirms an item, e.g. a posting.","composition":"The Like Glyph uses the \"thumbs up\" unicode emoji U+1F44D, see https:\/\/unicode.org\/emoji\/charts\/full-emoji-list.html.","effect":"Clicking toggles the state of the user expression. Clicking also updates the respective counter.","rivals":[]},"background":"","context":["Show timeline in groups and courses."],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"A Status Counter MUST indicate the overall amount of like expressions."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be 'Like'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphLove":{"id":"GlyphGlyphLove","title":"Love","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Clicking the Love Glyph indicates a user adores an item, e.g. a posting.","composition":"The Love Glyph uses the \"red heart\" unicode emoji U+2764, see https:\/\/unicode.org\/emoji\/charts\/full-emoji-list.html.","effect":"Clicking toggles the state of the user expression. Clicking also updates the respective counter.","rivals":[]},"background":"","context":["Show timeline in groups and courses."],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"A Status Counter MUST indicate the overall amount of love expressions."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be 'Love'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphDislike":{"id":"GlyphGlyphDislike","title":"Dislike","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Clicking the Dislike Glyph indicates a user objects an item, e.g. a posting.","composition":"The Dislike Glyph uses the \"thumbs down\" unicode emoji U+1F44E, see https:\/\/unicode.org\/emoji\/charts\/full-emoji-list.html.","effect":"Clicking toggles the state of the user expression. Clicking also updates the respective counter.","rivals":[]},"background":"","context":["Show timeline in groups and courses."],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"A Status Counter MUST indicate the overall amount of dislike expressions."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be 'Dislike'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphLaugh":{"id":"GlyphGlyphLaugh","title":"Laugh","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Clicking the Laugh Glyph indicates a user finds an item hilarious, e.g. a posting.","composition":"The Laugh Glyph uses the \"grinning face with smiling eyes\" unicode emoji U+1F604, see https:\/\/unicode.org\/emoji\/charts\/full-emoji-list.html.","effect":"Clicking toggles the state of the user expression. Clicking also updates the respective counter.","rivals":[]},"background":"","context":["Show timeline in groups and courses."],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"A Status Counter MUST indicate the overall amount of laugh expressions."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be 'Laugh'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphAstounded":{"id":"GlyphGlyphAstounded","title":"Astounded","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Clicking the Astounded Glyph indicates a user finds an item surprising, e.g. a posting.","composition":"The Astounded Glyph uses the \"face with open mouth\" unicode emoji U+1F62E, see https:\/\/unicode.org\/emoji\/charts\/full-emoji-list.html.","effect":"Clicking toggles the state of the user expression. Clicking also updates the respective counter.","rivals":[]},"background":"","context":["Show timeline in groups and courses."],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"A Status Counter MUST indicate the overall amount of astounded expressions."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be 'Astounded'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphSad":{"id":"GlyphGlyphSad","title":"Sad","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Clicking the Sad Glyph indicates a user finds an item disconcerting, e.g. a posting.","composition":"The Sad Glyph uses the \"sad but relieved face\" unicode emoji U+1F625, see https:\/\/unicode.org\/emoji\/charts\/full-emoji-list.html.","effect":"Clicking toggles the state of the user expression. Clicking also updates the respective counter.","rivals":[]},"background":"","context":["Show timeline in groups and courses."],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"A Status Counter MUST indicate the overall amount of sad expressions."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be 'Sad'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphAngry":{"id":"GlyphGlyphAngry","title":"Angry","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Clicking the Angry Glyph indicates a user finds an item outraging, e.g. a posting.","composition":"The Angry Glyph uses the \"angry face\" unicode emoji U+1F620, see https:\/\/unicode.org\/emoji\/charts\/full-emoji-list.html.","effect":"Clicking toggles the state of the user expression. Clicking also updates the respective counter.","rivals":[]},"background":"","context":["Show timeline in groups and courses."],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"A Status Counter MUST indicate the overall amount of angry expressions."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be 'Angry'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphEyeclosed":{"id":"GlyphGlyphEyeclosed","title":"Eyeclosed","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Eye Closed Glyph is used to toggle the revelation-mode of password fields. Whith the Eye Closed Glyph shown, the field is currently unmasked.","composition":"The Eye Closed Glyph uses the glyphicon-eye-close.","effect":"When clicked, the password-field is masked, thus hiding the input.","rivals":[]},"background":"","context":["Used with password-fields to toggle mask\/revealed mode."],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"The Eye Closed Glyph MUST only be used with Password-Inputs."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be \"eye closed - click to hide the input's contents\"."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphEyeopen":{"id":"GlyphGlyphEyeopen","title":"Eyeopen","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Eye Open Glyph is used to toggle the revelation-mode of password fields. With the Eye Open Glyph shown, the field is currently masked.","composition":"The Eye Open Glyph uses the glyphicon-eye-open.","effect":"When clicked, the password-field is unmasked, thus revealing the input.","rivals":[]},"background":"","context":["Used with password-fields to toggle mask\/revealed mode."],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"The Eye Open Glyph MUST only be used with Password-Inputs."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be \"eye open - click to reveal the input's contents\"."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphAttachment":{"id":"GlyphGlyphAttachment","title":"Attachment","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Attachment glyph indicates that a file is attached or can be attached to an object or entity.","composition":"The Attachment Glyph uses the glyphicon-paperclip.","effect":"Clicking executes an action which delivers these attachments to the actor or initiates a process to add new attachments.","rivals":[]},"background":"","context":["Impose the information whether or not files have been attached to emails in the folder view."],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"A Status Counter MAY indicate the overall amount of attachments."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The aria-label MUST be 'Attachment'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphReset":{"id":"GlyphGlyphReset","title":"Reset","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Reset Glyph is used to indicate the possibilty of resetting changes, which the user has made within a control, back to a previous state.","composition":"The Reset Glyph uses the glyphicon-repeat.","effect":"Upon clicking the related control is reloaded immediately and goes back to state before the user has started to make changes.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":["https:\/\/www.ilias.de\/docu\/goto.php?target=wiki_1357_Responsive_Table_Filters#ilPageTocA121"],"rules":{"usage":{"1":"The Reset Glyph SHOULD not come without an Apply Glyph and vice versa.","2":"If there are no changes to reset, the Reset Glyph MUST be deactivated (or not clickable)."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":{"1":"The deactivated state of the Reset Glyph MUST be visually noticeable for the user, i.e. by greying out the Reset Glyph."},"responsiveness":[],"accessibility":{"1":"The aria-label MUST be 'Reset'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"GlyphGlyphApply":{"id":"GlyphGlyphApply","title":"Apply","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Apply Glyph is used to indicate the possibilty of applying changes which the user has made within a control, i.e. a filter.","composition":"The Apply Glyph uses the glyphicon-ok.","effect":"Upon clicking the page is reloaded immediately with the updated content the control affects. In case of a filter, it means that the entries in a table change in accordance with the filter values.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":["https:\/\/www.ilias.de\/docu\/goto.php?target=wiki_1357_Responsive_Table_Filters#ilPageTocA121"],"rules":{"usage":{"1":"The Apply Glyph SHOULD not come without a Reset Glyph and vice versa.","2":"If there are no changes to apply, the Apply Glyph MUST be deactivated (or not clickable)."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":{"1":"The deactivated state of the Apply Glyph MUST be visually noticeable for the user, i.e. by greying out the Apply Glyph."},"responsiveness":[],"accessibility":{"1":"The aria-label MUST be 'Apply'."}},"parent":"GlyphFactoryGlyph","children":[],"less_variables":[],"path":"src\/UI\/Component\/Glyph\/Glyph"},"ButtonStandardStandard":{"id":"ButtonStandardStandard","title":"Standard","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The standard button is the default button to be used in ILIAS. If there is no good reason using another button instance in ILIAS, this is the one that should be used.","composition":"The standard button uses the primary color as background.","effect":"If the loading animation is activated, the button shows a spinner wheel on-click and automatically switches to a deactivated state.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Standard buttons MUST be used if there is no good reason using another instance.","2":"The loading animation SHOULD be activated if the Buttons starts any background process (e.g. ajax calls) without any other immediate feedback for the user. After the process finished, the button MUST be removed from\/replaced in the DOM."},"composition":[],"interaction":[],"wording":[],"ordering":{"1":"The most important standard button SHOULD be first in reading direction if there are several buttons.","2":"In the toolbar and in forms special regulations for the ordering of the buttons MAY apply."},"style":[],"responsiveness":{"1":"The most important standard button in multi-action bars MUST be sticky (stay visible on small screens)."},"accessibility":{"1":"Standard buttons MAY define aria-label attribute. Use it in cases where a text label is not visible on the screen or when the label does not provide enough information about the action.","2":"Standard buttons MAY define aria-checked attribute. Use it to inform which is the currently active button."}},"parent":"ButtonFactoryButton","children":[],"less_variables":[],"path":"src\/UI\/Component\/Button\/Standard"},"ButtonPrimaryPrimary":{"id":"ButtonPrimaryPrimary","title":"Primary","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The primary button indicates the most important action on a screen. By definition there can only be one single “most important” action on any given screen and thus only one single primary button per screen.","composition":"The background color is the btn-primary-color. This screen-unique button-color ensures that it stands out and attracts the user’s attention while there are several buttons competing for attention.","effect":"In toolbars the primary button are required to be sticky, meaning they stay in view in the responsive view. If the loading animation is activated, the button shows a spinner wheel on-click and automatically switches to a deactivated state.","rivals":[]},"background":"Tiddwell refers to the primary button as “prominent done button” and describes that “the button that finishes a transaction should be placed at the end of the visual flow; and is to be made big and well labeled.” She explains that “A well-understood, obvious last step gives your users a sense of closure. There’s no doubt that the transaction will be done when that button is clicked; don’t leave them hanging, wondering whether their work took effect”. The GNOME Human Interface Guidelines -> Buttons also describes a button indicated as most important for dialogs.","context":["“Start test” in Module “Test”","“Hand In” in exercise"],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Most pages SHOULD NOT have any Primary Button at all.","2":"There MUST be no more than one Primary Button per page in ILIAS.","3":"The decision to make a Button a Primary Button MUST be confirmed by the JF.","4":"The loading animation rules of the Standard Button MUST be respected."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"ButtonFactoryButton","children":[],"less_variables":[],"path":"src\/UI\/Component\/Button\/Primary"},"ButtonCloseClose":{"id":"ButtonCloseClose","title":"Close","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The close button triggers the closing of some collection displayed temporarily such as an overlay.","composition":"The close button is displayed without border.","effect":"Clicking the close button closes the enclosing collection.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":[],"interaction":[],"wording":[],"ordering":{"1":"The Close Button MUST always be positioned in the top right of a collection."},"style":[],"responsiveness":[],"accessibility":{"1":"The functionality of the close button MUST be indicated for screen readers by an aria-label."}},"parent":"ButtonFactoryButton","children":[],"less_variables":[],"path":"src\/UI\/Component\/Button\/Close"},"ButtonShyShy":{"id":"ButtonShyShy","title":"Shy","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Shy buttons are used in contexts that need a less obtrusive presentation than usual buttons have, e.g. in UI collections like Dropdowns.","composition":"Shy buttons do not come with a separte background color.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Shy buttons MUST only be used, if a standard button presentation is not appropriate. E.g. if usual buttons destroy the presentation of an outer UI component or if there is not enough space for a standard button presentation."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"ButtonFactoryButton","children":[],"less_variables":[],"path":"src\/UI\/Component\/Button\/Shy"},"ButtonMonthMonth":{"id":"ButtonMonthMonth","title":"Month","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Month Button enables to select a specific month to fire some action (probably a change of view).","composition":"The Month Button is composed of a Button showing the default month directly (probably the month currently rendered by some view). A dropdown contains an interface enabling the selection of a month from the future or the past.","effect":"Selecting a month from the dropdown directly fires the according action (e.g. switching the view to the selected month). Technically this is currently a Javascript event being fired.","rivals":[]},"background":"","context":["Marginal Grid Calendar"],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":[],"interaction":{"1":"Selecting a month from the dropdown MUST directly fire the according action."},"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"ButtonFactoryButton","children":[],"less_variables":[],"path":"src\/UI\/Component\/Button\/Month"},"ButtonTagTag":{"id":"ButtonTagTag","title":"Tag","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Tags classify entities. Thus, their primary purpose is the visualization of those classifications for one entity. However, tags are usually clickable - either to edit associations or list related entities, i.e. objects with the same tag.","composition":"Tags are a colored area with text on it. When used in a tag-cloud (a list of tags), tags can be visually \"weighted\" according to the number of their occurences, be it with different (font-)sizes, different colors or all of them.","effect":"Tags may trigger an action or change the view when clicked. There is no visual difference (besides the cursor) between clickable tags and tags with unavailable action.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":[],"interaction":[],"wording":[],"ordering":[],"style":{"1":"Tags SHOULD be used with an additonal class to adjust colors.","2":"The font-color SHOULD be set with high contrast to the chosen background color."},"responsiveness":[],"accessibility":{"1":"The functionality of the tag button MUST be indicated for screen readers by an aria-label."}},"parent":"ButtonFactoryButton","children":[],"less_variables":[],"path":"src\/UI\/Component\/Button\/Tag"},"ButtonBulkyBulky":{"id":"ButtonBulkyBulky","title":"Bulky","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The bulky button is highly obtrusive. It combines the recognisability of a graphical element with an explicit textual label on an unusually sized button. It is hard to overlook and indicates an important action on the screen.","composition":"The Bulky Button consists of an icon or glyph and a (very short) text.","effect":"The button has an \"engaged\"-state: When the button is used to toggle the visibility of a component, it stays engaged until the component is hidden again.","rivals":{"Primary Button":"Primary Buttons indicate the most important action among a collection of actions, e.g. in a tool bar, controls of a form or in a modal. Bulky Buttons make it hard to miss the indicated action by occupying space."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Since Bulky Buttons are so obtrusive they MUST only be used to indicate important actions on the screen."},"composition":[],"interaction":[],"wording":{"1":"The icon\/glyph and the text on the Bulky Button MUST be corresponding."},"ordering":[],"style":{"1":"Bulky Buttons MUST occupy as much space as their container leaves them.","2":"When used to toggle the visibility of another component, the button MUST reflect the componentes state of visibility."},"responsiveness":[],"accessibility":{"1":"The functionality of the Bulky Button MUST be indicated for screen readers by an aria-label.","2":"Bulky Buttons MUST define aria-pressed attribute."}},"parent":"ButtonFactoryButton","children":[],"less_variables":[],"path":"src\/UI\/Component\/Button\/Bulky"},"ButtonToggleToggle":{"id":"ButtonToggleToggle","title":"Toggle","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Toggle Button triggers the activation\/deactivation of some control already shown on the screen, i.e. a filter. The deactivation of a control means, that it is still shown and the user can still interact with it, but it has no effect on the system.","composition":"The Toggle Button uses different background colors for the on and off state. The toggle of the Toggle Button is placed on the left side when it is off, and on the right side when it is on.","effect":"Clicking the Toggle Button activates\/deactivates the related control. The on\/off state of the control is visually noticeable for the user, i.e. by greying out the control in the off state.","rivals":{"Checkbox":"Checkboxes are established as controls for choosing a value for submission and are therefore handled as Inputs. Toggle Buttons are used for switching the activation of some control and are therefore handled as Buttons.","Collapse\/Expand Glyph":"Collapse and Expand Glyphs hide or trigger the display of some content. Toggle Buttons leave a control visible to the user, but activate or deactivate it.","Mode View Control":"Mode View Controls enable the switching between different aspects of some data. Toggle Buttons activate\/deactivate some control, but do not change or switch the control which the user see currently."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"The Toggle Button MUST be placed next to the control it activates\/deactivates."},"composition":[],"interaction":[],"wording":[],"ordering":{"1":"The Toggle Button SHOULD be placed above the control it activates\/deactivates."},"style":[],"responsiveness":[],"accessibility":{"1":"The functionality of the Toggle Button MUST be indicated for screen readers by an aria-label.","2":"The state of the Toggle Button MUST be indicated for screen readers by using the aria-pressed attribute."}},"parent":"ButtonFactoryButton","children":[],"less_variables":[],"path":"src\/UI\/Component\/Button\/Toggle"},"DropdownStandardStandard":{"id":"DropdownStandardStandard","title":"Standard","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Standard Dropdown is the default Dropdown to be used in ILIAS. If there is no good reason using another Dropdown instance in ILIAS, this is the one that should be used.","composition":"The Standard Dropdown uses the primary color as background.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Standard Dropdown MUST be used if there is no good reason using another instance."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"DropdownFactoryDropdown","children":[],"less_variables":[],"path":"src\/UI\/Component\/Dropdown\/Standard"},"ViewControlModeMode":{"id":"ViewControlModeMode","title":"Mode","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Mode View Controls enable the switching between different aspects of some data. The different modes are mutually exclusive and can therefore not be activated at once.","composition":"Mode View Controls are composed of Buttons switching between active and inactive states.","effect":"Clicking on an inactive Button turns this button active and all other inactive. Clicking on an active button has no effect.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Exactly one Button MUST always be active."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The HTML container enclosing the buttons of the Mode View Control MUST cary the role-attribute \"group\".","2":"The HTML container enclosing the buttons of the Mode View Control MUST set an aria-label describing the element. Eg. \"Mode View Control\"","3":"The Buttons of the Mode View Control MUST set an aria-label clearly describing what the button shows if clicked. E.g. \"List View\", \"Month View\", ...","4":"The currently active Button must be labeled by setting aria-checked to \"true\"."}},"parent":"ViewControlFactoryViewControl","children":[],"less_variables":[],"path":"src\/UI\/Component\/ViewControl\/Mode"},"ViewControlSectionSection":{"id":"ViewControlSectionSection","title":"Section","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Section View Controls enable the switching between different sections of some data. Examples are subsequent days\/weeks\/months in a calendar or entries in a blog.","composition":"Section View Controls are composed of three Buttons. The Button on the left caries a Back Glyph, the Button in the middle is either a Default- or Split Button labeling the data displayed below and the Button on the right carries a next Glyph.","effect":"Clicking on the Buttons left or right changes the selection of the displayed data by a fixed interval. Clicking the Button in the middle opens the sections hinted by the label of the button (e.g. \"Today\").","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":null,"parent":"ViewControlFactoryViewControl","children":[],"less_variables":[],"path":"src\/UI\/Component\/ViewControl\/Section"},"ViewControlSortationSortation":{"id":"ViewControlSortationSortation","title":"Sortation","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The sortation view control enables users to change the order in which some data is presented. This control applies to all sorts of _structured_ data, like tables and lists.","composition":"Sortation uses a Dropdown to display a collection of shy-buttons.","effect":"A click on an option will change the ordering of the associated data-list by calling a page with a parameter according to the selected option or triggering a signal. The label displayed in the dropdown will be set to the selected sorting.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"A Sortation MUST NOT be used standalone.","2":"Sortations MUST BE visually close to the list or table their operation will have effect upon.","3":"There SHOULD NOT be more than one Sortation per view."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"Sortation MUST be operable via keyboard only."}},"parent":"ViewControlFactoryViewControl","children":[],"less_variables":[],"path":"src\/UI\/Component\/ViewControl\/Sortation"},"ViewControlPaginationPagination":{"id":"ViewControlPaginationPagination","title":"Pagination","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Pagination allows structured data being displayed in chunks by limiting the number of entries shown. It provides the user with controls to leaf through the chunks of entries.","composition":"Pagination is a collection of shy-buttons to access distinct chunks of data, framed by next\/back glyphs. When used with the \"DropdownAt\" option, a dropdown is rendered if the number of chunks exceeds the option's value.","effect":"A click on an chunk-option will change the offset of the displayed data-list, thus displaying the respective chunk of entries. The active option is rendered as an unavailable shy-button. Clicking the next\/back-glyphs, the previous (respectively: the next) chunk of entries is being displayed. If a previous\/next chunk is not available, the glyph is rendered unavailable. If the pagination is used with a maximum of chunk-options to be shown, both first and last options are always displayed.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"A Pagination MUST only be used for structured data, like tables and lists.","2":"A Pagination MUST NOT be used standalone.","3":"Paginations MUST be visually close to the list or table their operation will have effect upon. They MAY be placed directly above and\/or below the list."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"Pagination MUST be operable via keyboard only."}},"parent":"ViewControlFactoryViewControl","children":[],"less_variables":[],"path":"src\/UI\/Component\/ViewControl\/Pagination"},"ChartScaleBarScaleBar":{"id":"ChartScaleBarScaleBar","title":"Scale Bar","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Scale Bars are used to display a set of items some of which especially highlighted. E.g. they can be used to inform about a score or target on a rank ordered scale.","composition":"Scale Bars are composed of of a set of bars of equal size. Each bar contains a title. The highlighted elements differ from the others through their darkened background.","effect":"","rivals":[]},"background":"","context":["Scale Bars are are used in the Competence Management on the Personal Desktop."],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"Each Bar of the Scale Bars MUST bear a title.","2":"The title of Scale Bars MUST NOT contain any other content than text."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"ChartFactoryChart","children":[],"less_variables":[],"path":"src\/UI\/Component\/Chart\/ScaleBar"},"ChartProgressMeterFactoryProgressMeter":{"id":"ChartProgressMeterFactoryProgressMeter","title":"Progress Meter","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Progress Meters are used to display a progress or performance. E.g. they can be used to inform about a progress in a learning objective or to compare the performance between the initial and final test in a course.","composition":"Progress Meters are composed of one or two bars inside a horseshoe-like container. The bars change between two colors, to identify a specific reached value. It additionally may show a percentage of the values and also an identifying text.","effect":"","rivals":[]},"background":"","context":["Progress Meters are used inside courses on the content view."],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"Progress Meters MUST contain a maximum value. It MUST be numeric and represents the maximum value.","2":"Progress Meters MUST contain a main value. It MUST be a numeric value between 0 and the maximum. It is represented as the main bar.","3":"Progress Meters SHOULD contain a required value. It MUST be a numeric value between 0 and the maximum. It represents the required value that has to be reached."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"ChartFactoryChart","children":["ChartProgressMeterStandardStandard","ChartProgressMeterFixedSizeFixedSize","ChartProgressMeterMiniMini"],"less_variables":[],"path":"src\/UI\/Component\/Chart\/ProgressMeter\/Factory"},"ChartProgressMeterStandardStandard":{"id":"ChartProgressMeterStandardStandard","title":"Standard","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Standard Progress Meter is usually the tool of choice. The Progress Meter informs users about their Progress compared to a the required maximum.","composition":"The Standard Progress Meter is composed of one bar representing a value achieved in relation to a maximum and a required value indicated by some pointer. The comparison value is represented by a second bar below the first one. Also the percentage values of main and required are shown as text.","effect":"On changing screen size they decrease their size including font size in various steps.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"Standard Progress Meters MAY contain a comparison value. If there is a comparison value it MUST be a numeric value between 0 and the maximum. It is represented as the second bar.","2":"Standard Progress Meters MAY contain a main value text.","3":"Standard Progress Meters MAY contain a required value text."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"ChartProgressMeterFactoryProgressMeter","children":[],"less_variables":[],"path":"src\/UI\/Component\/Chart\/ProgressMeter\/Standard"},"ChartProgressMeterFixedSizeFixedSize":{"id":"ChartProgressMeterFixedSizeFixedSize","title":"Fixed Size","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Fixed Size Progress Meter ensures that the element is rendered exactly as set regardless of the screen size.","composition":"See composition description for Standard Progress Meter.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"See composition rules for Standard Progress Meter."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"ChartProgressMeterFactoryProgressMeter","children":[],"less_variables":[],"path":"src\/UI\/Component\/Chart\/ProgressMeter\/FixedSize"},"ChartProgressMeterMiniMini":{"id":"ChartProgressMeterMiniMini","title":"Mini","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Mini Progress Meter is used, if it needs to be as small as possible, like in an heading. It is used to display only a single Progress or performance indicator.","composition":"Other than the Standard and Fixed Size Progress Meter it does not allow a comparison value and only displays a single bar. It also does not display any text.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"See composition rules for Progress Meter."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"ChartProgressMeterFactoryProgressMeter","children":[],"less_variables":[],"path":"src\/UI\/Component\/Chart\/ProgressMeter\/Mini"},"InputFieldFactoryField":{"id":"InputFieldFactoryField","title":"Field","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Inputs fields are different from other UI components. They bundle two things: First, they are used for displaying, as similar to other components. Second, they are used to define the server side processing of data that is received from the client. Thus, an input field defines which visual input elements a user will see, which constraints are put on the data entered in these fields and which data developers on the server side retrieve from these inputs. Fields need to be enclosed by a container which defines the means of submitting the data collected by the fields and the way those inputs are arranged to be displayed for some client.","composition":"Fields are either individuals or groups of inputs. Both, individual fields and groups, share the same basic input interface. Input-Fields may have a label and byline.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"A byline (explanatory text) MAY be added to input fields."},"interaction":[],"wording":{"1":"If a label is set, it MUST be composed of one single term or a very short phrase. The identifier is an eye catcher for users skimming over a potentially large set of fields.","2":"If a label is set, it MUST avoid lingo. Intelligibility by occasional users is prioritized over technical accuracy. The accurate technical expression is to be mentioned in the byline.","3":"If a label is set, it MUST make a positive statement. If the purpose of the setting is inherently negative, use Verbs as “Limit..”, “Lock..”.","4":"If bylines are provided they MUST be informative, not merely repeating the identifier’s or input element’s content. If no informative description can be devised, no description is needed.","5":"A byline MUST clearly state what effect the fields produces and explain, why this might be important and what it can be used for.","6":"Bulk bylines underneath a stack of option explaining all of the options in one paragraph MUST NOT be used. Use individual bylines instead.","7":"A byline SHOULD NOT address the user directly. Addressing users directly is reserved for cases of high risk of severe mis-configuration.","8":"A byline MUST be grammatically complete sentence with a period (.) at the end.","9":"Bylines SHOULD be short with no more than 25 words.","10":"Bylines SHOULD NOT use any formatting in descriptions (bold, italic or similar).","11":"If bylines refer to other tabs or options or tables by name, that reference should be made in quotation marks:  ‘Info’-tab, button ‘Show Test Results’,  ‘Table of Detailed Test Results’. Use proper quotation marks, not apostrophes. Use single quotation marks for english language and double quotation marks for german language.","12":"By-lines MUST NOT feature parentheses since they greatly diminish readability.","13":"By-lines SHOULD NOT start with terms such as: If this option is set … If this setting is active … Choose this setting if … This setting … Rather state what happens directly: Participants get \/ make  \/ can … Point in time after which…. ILIAS will monitor… Sub-items xy are automatically whatever ... Xy will be displayed at place."},"ordering":[],"style":{"1":"Disabled input elements MUST be indicated by setting the “disabled” attribute.","2":"If focused, the input elements MUST change their input-border-color to the input-focus-border-color."},"responsiveness":[],"accessibility":{"1":"All fields visible in a view MUST be accessible by keyboard by using the ‘Tab’-Key."}},"parent":"InputFactoryInput","children":["InputFieldTextText","InputFieldNumericNumeric","InputFieldGroupGroup","InputFieldSectionSection","InputFieldDependantGroupDependantGroup","InputFieldCheckboxCheckbox","InputFieldTagTag","InputFieldPasswordPassword","InputFieldSelectSelect","InputFieldTextareaTextarea","InputFieldRadioRadio","InputFieldMultiSelectMultiSelect"],"less_variables":[],"path":"src\/UI\/Component\/Input\/Field\/Factory"},"InputContainerFactoryContainer":{"id":"InputContainerFactoryContainer","title":"Container","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"An input container defines which means are used to submit the data to the system and how input-fields are being displayed in the UI. Furthermore containers will process received data according to the transformations and constraints of its fields.","composition":"A Container holds one ore more fields.","effect":"","rivals":{"Group Field Input":"Groups are used within containers to functionally bundle input-fields.","Section Field Input":"Sections are used within containers to visually tie fields together."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":null,"parent":"InputFactoryInput","children":["InputContainerFormFactoryForm"],"less_variables":[],"path":"src\/UI\/Component\/Input\/Container\/Factory"},"InputFieldTextText":{"id":"InputFieldTextText","title":"Text","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A text-field is intended for entering short single-line texts.","composition":"Text fields will render an input-tag with type=\"text\".","effect":"Text inputs are restricted to one line of text.","rivals":{"numeric field":"Use a numeric field if users should input numbers.","alphabet field":"Use an alphabet field if the user should input single letters."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Text Input MUST NOT be used for choosing from predetermined options.","2":"Text input MUST NOT be used for numeric input, a Numeric Field is to be used instead.","3":"Text Input MUST NOT be used for letter-only input, an Alphabet Field is to be used instead."},"composition":[],"interaction":{"1":"Text Input MUST limit the number of characters, if a certain length of text-input may not be exceeded (e.g. due to database-limitations)."},"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"InputFieldFactoryField","children":[],"less_variables":[],"path":"src\/UI\/Component\/Input\/Field\/Text"},"InputFieldNumericNumeric":{"id":"InputFieldNumericNumeric","title":"Numeric","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A numeric field is used to retrieve numeric values from the user.","composition":"Numeric inputs will render an input-tag with type=\"number\".","effect":"The field does not accept any data other than numeric values. When focused most browser will show a small vertical rocker to increase and decrease the value in the field.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Number Inputs MUST NOT be used for binary choices.","2":"Magic numbers such as -1 or 0 to specify “limitless” or smoother options MUST NOT be used.","3":"A valid input range SHOULD be specified."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"InputFieldFactoryField","children":[],"less_variables":[],"path":"src\/UI\/Component\/Input\/Field\/Numeric"},"InputFieldGroupGroup":{"id":"InputFieldGroupGroup","title":"Group","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Input groups are an unlabeled collection of inputs. They are used to build logical units of other fields. Such units might be used to attach some constraints or transformations for multiple fields.","composition":"Groups are composed of inputs. They do not contain a label. The grouping remains invisible for the client.","effect":"There is no visible effect using groups.","rivals":{"sections":"Sections are used to generate a visible relation of fields."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"InputFieldFactoryField","children":[],"less_variables":[],"path":"src\/UI\/Component\/Input\/Field\/Group"},"InputFieldSectionSection":{"id":"InputFieldSectionSection","title":"Section","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Sections are used to visually group inputs to a common context.","composition":"Sections are composed of inputs. They carry a label and are visible for the client.","effect":"","rivals":{"Groups":"Groups are used as purely logical units, while sections visualize the correlation of fields."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":{"1":"Sections SHOULD comprise 2 to 5 Settings.","2":"More than 5 Settings SHOULD be split into two areas unless this would tamper with the “familiar” information architecture of forms.","3":"In standard forms, there MUST NOT be a Setting without an enclosing Titled Form Section. If necessary a Titled Form Section MAY contain only one single Setting."},"interaction":[],"wording":{"1":"The label SHOULD summarize the contained settings accurately from a user’s perspective.","2":"The title SHOULD contain less than 30 characters.","3":"The titles MUST be cross-checked with similar sections in other objects or services to ensure consistency throughout ILIAS.","4":"In doubt consistency SHOULD be prioritized over accuracy in titles."},"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"InputFieldFactoryField","children":[],"less_variables":[],"path":"src\/UI\/Component\/Input\/Field\/Section"},"InputFieldDependantGroupDependantGroup":{"id":"InputFieldDependantGroupDependantGroup","title":"Dependant Group","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Fields can be nested by using dependant groups (formerly known as subforms) allowing for settings-dependent configurations.","composition":"Dependant groups are like groups composed of a set of input fields.","effect":"The display of dependent group is triggered by enabling some other input field which has an attached dependant group. Note that not all fields allow this (e.g. Checkboxes do). Look at the interface whether and how dependant groups can be attached.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"There MUST NOT be a nesting of more than one dependant group. The only exception to this rule is the required quantification of a subsetting by a date or number. These exceptions MUST individually accepted by the Jour Fixe."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"InputFieldFactoryField","children":[],"less_variables":[],"path":"src\/UI\/Component\/Input\/Field\/DependantGroup"},"InputFieldCheckboxCheckbox":{"id":"InputFieldCheckboxCheckbox","title":"Checkbox","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A checkbox is used to govern a state, action, or set \/ not to set a value. Checkboxes are typically used to switch on some additional behaviour or services.","composition":"Each Checkbox is labeled by an identifier stating something positive to describe the effect of checking the Checkbox.","effect":"If used in a form, a checkbox may open a dependant section (formerly known as sub form).","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"A checkbox MUST NOT be used whenever a user has to perform a binary choice where option is not automatically the inverse of the other (such as 'Order by Date' and 'Order by Name'). A Select Input or a Radio Group in MUST be used in this case."},"composition":[],"interaction":[],"wording":{"1":"The checkbox’s identifier MUST always state something positive."},"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"InputFieldFactoryField","children":[],"less_variables":[],"path":"src\/UI\/Component\/Input\/Field\/Checkbox"},"InputFieldTagTag":{"id":"InputFieldTagTag","title":"Tag","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A Tag Input is used to choose a subset amount of tags (techn.: array of strings) out of a finite list of tags. The Tag Field SHOULD be used, whenever it is not required or not possible to display all available options, e.g. because the amount is too high when the options are \"all users\" or \"all tags. Besides the tags to choose from, the user can provide own tags by typing them into the Input (@see Tag::withOptionsAreExtendable ).","composition":"The Input is presented as a text-input and prepended by already selected tags presented as texts including a close-button.  (e.g. [ Amsterdam X ] ) The input is labeled by the label given. Suggested tags are listed in a dropdown-list beneath the text-input. All mentioned elements are not taken from the UI-Service.","effect":"As soon as the user types in the text-input, the Tag Input suggests matching tags from the the given list of tags. Suggestions will appear after a defined amount of characters, one by default. Clicking on one of these tags closes the list and transfers the selected tag into the text-input, displayed as a tag with a close-button. By clicking on a close-button of a already selected tag, this tag will disappear from the Input. All mentioned elements are not taken from the UI-Service.","rivals":[]},"background":"","context":["Tag Input is used in forms."],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"A Tag Input MUST NOT be used whenever a user has to perform a binary choice where option is automatically the inverse of the other. A Checkbox MUST be used in this case.","2":"A Tag Input MUST NOT be used whenever a user has to perform a choice from a list of options where only one Option has to be selected. A Select MUST be used in this case (Not yet part of the KitchenSink).","3":"A Tag Input SHOULD be used whenever a User should be able to extend the list of given options.","4":"A Tag Input MUST NOT be used when a User has to choose from a finite list of options which can't be extended by users Input, a Multi Select MUST be used in this case","5":"The tags provided SHOULD NOT have long titles (50 characters)."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"InputFieldFactoryField","children":[],"less_variables":[],"path":"src\/UI\/Component\/Input\/Field\/Tag"},"InputFieldPasswordPassword":{"id":"InputFieldPasswordPassword","title":"Password","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A password-field is intended for entering passwords.","composition":"Text password will render an input-tag with type=\"password\". Optionally, an eye-closed\/open glyph is rendered above the input to toggle revelation\/masking.","effect":"Text password is restricted to one line of text and will mask the entered characters. When configured with the revelation-option, the clear-text password will be shown (respectively hidden) upon clicking the glyph.","rivals":{"text field":"Use a text field for discloseable information (i.e. information that can safely be displayed to an audience)"}},"background":"","context":["Login-Form and own profile (change Password)."],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Password Input MUST be used for passwords."},"composition":[],"interaction":{"1":"Password Input SHOULD NOT limit the number of characters.","2":"When used for authentication, Password Input MUST NOT reveal any settings by placing constraints on it.","3":"On the other hand, when setting a password, Password Input SHOULD enforce strong passwords by appropiate contraints."},"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"InputFieldFactoryField","children":[],"less_variables":[],"path":"src\/UI\/Component\/Input\/Field\/Password"},"InputFieldSelectSelect":{"id":"InputFieldSelectSelect","title":"Select","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A select is used to allow users to pick among a number of options.","composition":"Select field will render a select-tag with a number of options. First option contains the string \"-\" and it is selectable depending on the required property.","effect":"Only one option is selectable. If the property required is set as true, the first option will be hidden after clicking on the select input at the first time.","rivals":{"Checkbox field":"Use a checkbox field for a binary yes\/no choice.","Radio buttons":"Use radio buttons when the alternatives matter. When is wanted to user to see what they are not choosing. If it is a long list or the alternatives are not that important, use a select."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Select Input MAY be used for choosing from predetermined options."},"composition":[],"interaction":{"1":"Only one option is selectable.","2":"First Option MAY be selectable when the field is not required."},"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"InputFieldFactoryField","children":[],"less_variables":[],"path":"src\/UI\/Component\/Input\/Field\/Select"},"InputFieldTextareaTextarea":{"id":"InputFieldTextareaTextarea","title":"Textarea","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A textarea is intended for entering multi-line texts.","composition":"Textarea fields will render an textarea HTML tag. If a limit is set, a byline about limitation is automatically set.","effect":"Textarea inputs are NOT restricted to one line of text. A textarea counts the amount of character input by user and displays the number.","rivals":{"text field":"Use a text field if users should input only one line of text.","numeric field":"Use a numeric field if users should input numbers.","alphabet field":"Use an alphabet field if the user should input single letters."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Textarea Input MUST NOT be used for choosing from predetermined options.","2":"Textarea input MUST NOT be used for numeric input, a Numeric Field is to be used instead.","3":"Textarea Input MUST NOT be used for letter-only input, an Alphabet Field is to be used instead.","4":"Textarea Input MUST NOT be used for single-line input, a Text Field is to be used instead.","5":"If a min. or max. number of characters is set for textarea, a byline MUST be added stating the number of min. and\/or max. characters."},"composition":[],"interaction":{"1":"Textarea Input MAY limit the number of characters, if a certain length of text-input may not be exceeded (e.g. due to database-limitations)."},"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"InputFieldFactoryField","children":[],"less_variables":[],"path":"src\/UI\/Component\/Input\/Field\/Textarea"},"InputFieldRadioRadio":{"id":"InputFieldRadioRadio","title":"Radio","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A Radio Input is used to depict a choice of options excluding each other.","composition":"The Radio is considered as one field with a label and a number of options. Each option in turn bears a label in form of a positive statement.","effect":"If used in a form, each option of a Radio may open a Dependant Section (formerly known as Sub Form).","rivals":{"Checkbox Field":"Use a Checkbox Field for a binary yes\/no choice.","Select":"Use Selects to choose items from a longer list as the configuration of an aspect; when the choice has severe effects on, e.g. service behavior, or needs further configuration, stick to radios."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"A Radio Input SHOULD contain 3 to 5 options. If there are more, the Select Input might be the better option.","2":"Radios MAY also be used to select between two options where one is not automatically the inverse of the other"},"composition":[],"interaction":[],"wording":{"1":"Each option MUST be labeled.","2":"The options' labels MUST state something positive.","3":"An option's label SHOULD not simply repeat the label of the Radio. A meaningful labeling SHOULD be chosen instead."},"ordering":{"1":"The presumably most relevant option SHOULD be the first option."},"style":[],"responsiveness":[],"accessibility":[]},"parent":"InputFieldFactoryField","children":[],"less_variables":[],"path":"src\/UI\/Component\/Input\/Field\/Radio"},"InputFieldMultiSelectMultiSelect":{"id":"InputFieldMultiSelectMultiSelect","title":"Multi Select","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A Multi Select is used to allow users to pick several options from a list.","composition":"The Multi Select field will render labeled checkboxes according to given options.","effect":"","rivals":{"Checkbox Field":"Use a Checkbox Field for a binary yes\/no choice.","Tag Field":"Use a Tag Input when the user is able to extend the list of given options.","Select Field":"Use a Select Input when the user's choice is limited to one option or the options are mutually exclusive."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"A Multi Select input SHOULD be used when a user has to choose from a finite list of options which cannot be extended by the user's input and where more than one choice can be made.","2":"A Multi Select input MUST NOT be used whenever a user has to perform a binary choice where option is automatically the inverse of the other. A Checkbox MUST be used in this case.","3":"A Multi Select input MUST NOT be used whenever a user has to perform a choice from a list of options where only one option can be selected. A Select MUST be used in this case"},"composition":[],"interaction":[],"wording":{"1":"Each option MUST be labeled.","2":"If the option governs a change of (service-)behavior, the option's label MUST be in form of a positive statement."},"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"InputFieldFactoryField","children":[],"less_variables":[],"path":"src\/UI\/Component\/Input\/Field\/MultiSelect"},"InputContainerFormFactoryForm":{"id":"InputContainerFormFactoryForm","title":"Form","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Forms are used to let the user enter or modify data, check her inputs and submit them to the system. Forms arrange their contents (i.e. fields) in an explanatory rather than space-saving way.","composition":"Forms are composed of input fields, displaying their labels and bylines.","effect":"","rivals":{"filter":"Filters are used to limit search results; they never modify data in the system."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":null,"parent":"InputContainerFactoryContainer","children":["InputContainerFormStandardStandard"],"less_variables":[],"path":"src\/UI\/Component\/Input\/Container\/Form\/Factory"},"InputContainerFormStandardStandard":{"id":"InputContainerFormStandardStandard","title":"Standard","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Standard Forms are used for creating content of sub-items or for configuring objects or services.","composition":"Standard forms provide a submit-button.","effect":"The users manipulates input-values and saves the form to apply the settings to the object or service or create new entities in the system.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Standard Forms MUST NOT be used on the same page as tables.","2":"Standard Forms MUST NOT be used on the same page as toolbars."},"composition":{"1":"Each form SHOULD contain at least one section displaying a title.","2":"Standard Forms MUST only be submitted by their submit-button. They MUST NOT be submitted by anything else.","3":"Wording of labels of the fields the form contains and their ordering MUST be consistent with identifiers in other objects if some for is used there for a similar purpose. If you feel a wording or ordering needs to be changed, then you MUST propose it to the JF.","4":"On top and bottom of a standard form there SHOULD be the “Save” button for the form.","5":"In some rare exceptions the Buttons MAY be named differently: if “Save” is clearly a misleading since the action is more than storing the data into the database. “Send Mail” would be an example of this."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"InputContainerFormFactoryForm","children":[],"less_variables":[],"path":"src\/UI\/Component\/Input\/Container\/Form\/Standard"},"CardStandardStandard":{"id":"CardStandardStandard","title":"Standard","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Standard Card is the default Card to be used in ILIAS. If there is no good reason using another Card instance in ILIAS, this is the one that should be used.","composition":"","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":["http:\/\/www.ilias.de\/docu\/goto_docu_wiki_wpage_3208_1357.html"],"rules":{"usage":{"1":"Standard Card MUST be used if there is no good reason using another instance."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"CardFactoryCard","children":[],"less_variables":[],"path":"src\/UI\/Component\/Card\/Standard"},"CardRepositoryObjectRepositoryObject":{"id":"CardRepositoryObjectRepositoryObject","title":"Repository Object","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Repository Object cards are used in contexts that more visual information about the repository object type is needed.","composition":"Repository Object cards add icons on a darkened layer over the image. This Darkened layer is divided into 4 horizontal cells where the icons can be located. Starting from the left, the icons have the following order:\n    Cell 1: Object type (UI Icon)\n    Cell 2: Learning Progress (UI ProgressMeter in the mini version) or Certificate (UI Icon)\n    Cell 3: Empty\n    Cell 4: Actions (UI Dropdown)\nCells and its content are responsively adapted if the size of the screen is changed.","effect":"","rivals":{"Item":"Items are used in lists or similar contexts."}},"background":"","context":[],"selector":"","feature_wiki_references ":["https:\/\/docu.ilias.de\/goto_docu_wiki_wpage_4921_1357.html"],"rules":{"usage":{"1":"Repository Object Cards MAY contain a UI Icon displaying the object type.","2":"Repository Object Cards MAY contain a UI ProgressMeter displaying the learning progress of the user.","3":"Repository Object Cards MAY contain a UI Icon displaying a certificate icon if the user finished the task.","4":"Repository Object Cards MAY contain a UI ProgressMeter OR UI Icon certificate, NOT both."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"CardFactoryCard","children":[],"less_variables":[],"path":"src\/UI\/Component\/Card\/RepositoryObject"},"ListingUnorderedUnordered":{"id":"ListingUnorderedUnordered","title":"Unordered","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Unordered Lists are used to display a unordered set of textual elements.","composition":"Unordered Lists are composed of a set of bullets labeling the listed items.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":null,"parent":"ListingFactoryListing","children":[],"less_variables":[],"path":"src\/UI\/Component\/Listing\/Unordered"},"ListingOrderedOrdered":{"id":"ListingOrderedOrdered","title":"Ordered","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Ordered Lists are used to displayed a numbered set of textual elements. They are used if the order of the elements is relevant.","composition":"Ordered Lists are composed of a set of numbers labeling the items enumerated.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":null,"parent":"ListingFactoryListing","children":[],"less_variables":[],"path":"src\/UI\/Component\/Listing\/Ordered"},"ListingDescriptiveDescriptive":{"id":"ListingDescriptiveDescriptive","title":"Descriptive","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Descriptive Lists are used to display key-value doubles of textual-information.","composition":"Descriptive Lists are composed of a key acting as title describing the type of information being displayed underneath.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":null,"parent":"ListingFactoryListing","children":[],"less_variables":[],"path":"src\/UI\/Component\/Listing\/Descriptive"},"ListingWorkflowFactoryWorkflow":{"id":"ListingWorkflowFactoryWorkflow","title":"Workflow","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A workflow presents a list of steps that the user should tackle in a defined order.","composition":"The workflow has a title and a list of workflow steps.","effect":"Steps in a workflow reflect their progress (not applicable, not started, in progress, completed). The currently active step is marked as such. Clicking the step of a workflow MAY trigger navigation.","rivals":{"OrderedListing":"Items (Steps) in a workflow relate to some task; they reflect the tasks's progress and may be used to navigate to respective views."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":null,"parent":"ListingFactoryListing","children":["ListingWorkflowStepStep","ListingWorkflowLinearLinear"],"less_variables":[],"path":"src\/UI\/Component\/Listing\/Workflow\/Factory"},"ListingWorkflowStepStep":{"id":"ListingWorkflowStepStep","title":"Step","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A workflow step represents a single step in a sequence of steps. The status of a step consists of two parts: its availability and its outcome or result. Possible variants of availability are \"available\", \"not available\" and \"not available anymore\". The status \"active\" will be set by the workflow. The status of a step is defined as \"not started\", \"in progress\", \"completed successfully\" and \"unsuccessfully completed\".","composition":"A workflow step consists of a label, a description and a marker that indicates its availability and result. If a step is available and carries an action, the label is rendered as shy-button.","effect":"A Step MAY have an action; when clicked, the action is triggered.","rivals":[]},"background":"","context":["A Step MUST be used within a Workflow."],"selector":"","feature_wiki_references ":[],"rules":null,"parent":"ListingWorkflowFactoryWorkflow","children":[],"less_variables":[],"path":"src\/UI\/Component\/Listing\/Workflow\/Step"},"ListingWorkflowLinearLinear":{"id":"ListingWorkflowLinearLinear","title":"Linear","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A linear workflow is the basic form of a workflow: the user should tackle every step, one after the other.","composition":"A linear workflow has a title and lists a sequence of steps. If the user is currently working on a step, the step is marked as active.","effect":"A Step MAY have an action; when clicked, the action is triggered.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Use a Linear Worflow for a set of tasks that should be performed one after the other and where there are no inter-dependencies other than completeliness of the prior task.","2":"You SHOULD NOT use Linear Workflow for workflows with forked pathes due to user-decisions or calculations.","3":"You SHOULD NOT use Linear Workflow for continous workflows; a inear workflow MUST have a start- and and end-point."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"ListingWorkflowFactoryWorkflow","children":[],"less_variables":[],"path":"src\/UI\/Component\/Listing\/Workflow\/Linear"},"PanelStandardStandard":{"id":"PanelStandardStandard","title":"Standard","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Standard Panels are used in the Center Content section to group content.","composition":"Standard Panels consist of a title and a content section. The structure of this content might be varying from Standard Panel to Standard Panel. Standard Panels may contain Sub Panels.","effect":"","rivals":{"Cards":"Often Cards are used in Decks to display multiple uniformly structured chunks of Data horizontally and vertically."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"In Forms Standard Panels MUST be used to group different sections into Form Parts.","2":"Standard Panels SHOULD be used in the Center Content as primary Container for grouping content of varying content."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"PanelFactoryPanel","children":[],"less_variables":[],"path":"src\/UI\/Component\/Panel\/Standard"},"PanelSubSub":{"id":"PanelSubSub","title":"Sub","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Sub Panels are used to structure the content of Standard panels further into titled sections.","composition":"Sub Panels consist of a title and a content section. They may contain a Card on their right side to display meta information about the content displayed.","effect":"","rivals":{"Standard Panel":"The Standard Panel might contain a Sub Panel.","Card":"The Sub Panels may contain one Card."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Sub Panels MUST only be inside Standard Panels"},"composition":{"1":"Sub Panels MUST NOT contain Sub Panels or Standard Panels as content."},"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"PanelFactoryPanel","children":[],"less_variables":[],"path":"src\/UI\/Component\/Panel\/Sub"},"PanelReportReport":{"id":"PanelReportReport","title":"Report","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Report Panels display user-generated data combining text in lists, tables and sometimes  charts. Report Panels always draw from two distinct sources: the structure \/ scaffolding of the Report Panels stems from user-generated content (i.e a question of a survey, a competence with levels) and is filled with user-generated content harvested by that very structure (i.e. participants’ answers to the question, self-evaluation of competence).","composition":"They are composed of a Standard Panel which contains several Sub Panels. They might also contain a card to display information meta information in their first block.","effect":"Report Panels are predominantly used for displaying data. They may however comprise links or buttons.","rivals":{"Standard Panels":"The Report Panels contains sub panels used to structure information.","Presentation Table":"Presentation Tables display only a subset of the data at first glance; their entries can then be expanded to show detailed information."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Report Panels SHOULD be used when user generated content of two sources (i.e results, guidelines in a template) is to be displayed alongside each other."},"composition":[],"interaction":{"1":"Links MAY open new views.","2":"Buttons MAY trigger actions or inline editing."},"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"PanelFactoryPanel","children":[],"less_variables":[],"path":"src\/UI\/Component\/Panel\/Report"},"PanelListingFactoryListing":{"id":"PanelListingFactoryListing","title":"Listing","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Listing Panels are used to list items following all one single template.","composition":"Listing Panels are composed of several titled Item Groups. They further may contain a filter.","effect":"The List Items of Listing Panels may contain a dropdown offering options to interact with the item. Further Listing Panels may be filtered and the number of sections or items to be displayed may be configurable.","rivals":{"Report Panels":"Report Panels contain sections as Sub Panels each displaying different aspects of one item.","Presentation Table":"Use Presentation Table if you have a data set at hand that you want to make explorable and\/or present as a wholeness. Also use Presentation Table if your dataset does not contain Items that represent entities."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Listing Panels SHOULD be used, if a large number of items using the same template are to be displayed in an inviting way not using a Table."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"PanelFactoryPanel","children":["PanelListingStandardStandard"],"less_variables":[],"path":"src\/UI\/Component\/Panel\/Listing\/Factory"},"PanelListingStandardStandard":{"id":"PanelListingStandardStandard","title":"Standard","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Standard item lists present lists of items with similar presentation. All items are passed by using Item Groups.","composition":"This Listing is composed of title and a set of Item Groups. Additionally an optional dropdown to select the number\/types of items to be shown at the top of the Listing.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":null,"parent":"PanelListingFactoryListing","children":[],"less_variables":[],"path":"src\/UI\/Component\/Panel\/Listing\/Standard"},"ItemStandardStandard":{"id":"ItemStandardStandard","title":"Standard","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"This is a standard item to be used in lists or similar contexts.","composition":"A list item consists of a title and the following optional elements: description, action drop down, properties (name\/value), a text or image or icon lead and a color. Property values MAY be interactive by using Shy Buttons.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"Information MUST NOT be provided by color alone. The same information could be presented, e.g. in a property to enable screen reader access."}},"parent":"ItemFactoryItem","children":[],"less_variables":[],"path":"src\/UI\/Component\/Item\/Standard"},"ItemGroupGroup":{"id":"ItemGroupGroup","title":"Group","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"An Item Group groups items of a certain type.","composition":"An Item Group consists of a header with an optional action Dropdown and a list if Items.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":null,"parent":"ItemFactoryItem","children":[],"less_variables":[],"path":"src\/UI\/Component\/Item\/Group"},"ModalInterruptiveInterruptive":{"id":"ModalInterruptiveInterruptive","title":"Interruptive","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"An Interruptive modal disrupts the user in critical situation, forcing him or her to focus on the task at hand.","composition":"The modal states why this situation needs attention and may point out consequences.","effect":"All controls of the original context are inaccessible until the modal is completed. Upon completion the user returns to the original context.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Due to the heavily disruptive nature of this type of modal it MUST be restricted to critical situations (e.g. loss of data).","2":"All actions where data is deleted from the system are considered to be critical situations and SHOULD be implemented as an Interruptive modal. Exceptions are possible if items from lists in forms are to be deleted or if the modal would heavily disrupt the workflow.","3":"Interruptive modals MUST contain a primary button continuing the action that initiated the modal (e.g. Delete the item) on the left side of the footer of the modal and a default button canceling the action on the right side of the footer.","4":"The cancel button in the footer and the close button in the header MUST NOT perform any additional action than closing the Interruptive modal."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"ModalFactoryModal","children":[],"less_variables":[],"path":"src\/UI\/Component\/Modal\/Interruptive"},"InterruptiveItemInterruptiveItem":{"id":"InterruptiveItemInterruptiveItem","title":"Interruptive Item","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Interruptive items are displayed in an Interruptive modal and represent the object(s) being affected by the critical action, e.g. deleting.","composition":"An Interruptive item is composed of an Id, title, description and an icon.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"An interruptive item MUST have an ID and title.","2":"An interruptive item SHOULD have an icon representing the affected object.","3":"An interruptive item MAY have a description which helps to further identify the object. If an Interruptive modal displays multiple items having the the same title, the description MUST be used in order to distinct these objects from each other.","4":"If an interruptive item represents an ILIAS object, e.g. a course, then the Id, title, description and icon of the item MUST correspond to the Id, title, description and icon from the ILIAS object."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"ModalFactoryModal","children":[],"less_variables":[],"path":"InterruptiveItem"},"ModalRoundTripRoundtrip":{"id":"ModalRoundTripRoundtrip","title":"Roundtrip","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Round-Trip modals are to be used if the context would be lost by performing this action otherwise. Round-Trip modals accommodate sub-workflows within an overriding workflow. The Round-Trip modal ensures that the user does not leave the trajectory of the overriding workflow. This is typically the case if an ILIAS service is being called while working in an object.","composition":"Round-Trip modals are completed by a well defined sequence of only a few steps that might be displayed on a sequence of different modals connected through some \"next\" button.","effect":"Round-Trip modals perform sub-workflow involving some kind of user input. Sub-workflow is completed and user is returned to starting point allowing for continuing the overriding workflow.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Round-Trip modals MUST contain at least two buttons at the bottom of the modals: a button to cancel (right) the workflow and a button to finish or reach the next step in the workflow (left).","2":"Round-Trip modals SHOULD be used, if the user would lose the context otherwise. If the action can be performed within the same context (e.g. add a post in a forum, edit a wiki page), a Round-Trip modal MUST NOT be used.","3":"When the workflow is completed, Round-Trip modals SHOULD show the same view that was displayed when initiating the modal.","4":"Round-Trip modals SHOULD NOT be used to add new items of any kind since adding item is a linear workflow redirecting to the newly added item setting- or content-tab.","5":"Round-Trip modals SHOULD NOT be used to perform complex workflows."},"composition":[],"interaction":[],"wording":{"1":"The label of the Button used to close the Round-Trip-Modal MAY be adapted, if the default label (cancel) does not fit the workflow presented on the screen."},"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"ModalFactoryModal","children":[],"less_variables":[],"path":"src\/UI\/Component\/Modal\/RoundTrip"},"ModalLightboxLightbox":{"id":"ModalLightboxLightbox","title":"Lightbox","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Lightbox modal displays media data such as images or videos. It may also display text that has a purely descriptive nature and does not offer interaction.","composition":"A Lightbox modal consists of one or multiple lightbox pages representing the text or media together with a title.","effect":"Lightbox modals are activated by clicking the full view glyphicon, the title of the object or it's thumbnail. If multiple pages are to be displayed, they can flipped through.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Lightbox modals MUST contain a title above the presented item.","2":"Lightbox modals SHOULD contain a descriptional text below the presented items.","3":"Multiple items inside a Lightbox modal MUST be presented in carousel like manner allowing to flickr through items."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"ModalFactoryModal","children":[],"less_variables":[],"path":"src\/UI\/Component\/Modal\/Lightbox"},"LightboxImagePageLightboxImagePage":{"id":"LightboxImagePageLightboxImagePage","title":"Lightbox Image Page","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A Lightbox image page represents an image inside a Lightbox modal.","composition":"The page consists of the image, a title and optional description.","effect":"The image is displayed in the content section of the Lightbox modal and the title is used as modal title. If a description is present, it will be displayed below the image.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"2":"A Lighbox image page MUST have an image and a short title.","1":"A Lightbox image page SHOULD have short a description, describing the presented image. If the description is omitted, the Lightbox image page falls back to the alt tag of the image."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"ModalFactoryModal","children":[],"less_variables":[],"path":"LightboxImagePage"},"LightboxTextPageLightboxTextPage":{"id":"LightboxTextPageLightboxTextPage","title":"Lightbox Text Page","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A Lightbox text page represents a document like content\/text inside a Lightbox modal.","composition":"The page consists of text and a title","effect":"The text is displayed in the content section of the Lightbox modal and the title is used as modal title.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"A Lighbox text page MUST have text content and a short title.","2":"A Lighbox text page MUST NOT have a description."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"ModalFactoryModal","children":[],"less_variables":[],"path":"LightboxTextPage"},"PopoverStandardStandard":{"id":"PopoverStandardStandard","title":"Standard","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Standard Popovers are used to display other components. Whenever you want to use the standard-popover, please hand in a PullRequest and discuss it.","composition":"The content of a Standard Popover displays the components together with an optional title.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Standard Popovers MUST NOT be used to render lists, use a Listing Popover for this purpose.","2":"Standard Popovers SHOULD NOT contain complex or large components.","3":"Usages of Standard Popovers MUST be accepted by JourFixe.","4":"Popovers with fixed Position MUST only be attached to triggerers with fixed position."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"PopoverFactoryPopover","children":[],"less_variables":[],"path":"src\/UI\/Component\/Popover\/Standard"},"PopoverListingListing":{"id":"PopoverListingListing","title":"Listing","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"Listing Popovers are used to display list items.","composition":"The content of a Listing Popover displays the list together with an optional title.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Listing Popovers MUST be used if one needs to display lists inside a Popover.","2":"Popovers with fixed Position MUST only be attached to triggerers with fixed position."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"PopoverFactoryPopover","children":[],"less_variables":[],"path":"src\/UI\/Component\/Popover\/Listing"},"DropzoneFileFactoryFile":{"id":"DropzoneFileFactoryFile","title":"File","abstract":1,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"File dropzones are used to drop files from outside the browser window. The dropped files are presented to the user and can be uploaded to the server. File dropzones offer additional convenience beside manually selecting files over the file browser.","composition":"File dropzones are areas to drop the files. They contain either a message (standard file dropzone) or other ILIAS UI components (wrapper file dropzone).","effect":"A dropzone is highlighted when the user drags files over it.","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":[],"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"There MUST be alternative ways in the system to upload the files due to the limited accessibility of file dropzones."}},"parent":"DropzoneFactoryDropzone","children":["DropzoneFileStandardStandard","DropzoneFileWrapperWrapper"],"less_variables":[],"path":"src\/UI\/Component\/Dropzone\/File\/Factory"},"DropzoneFileStandardStandard":{"id":"DropzoneFileStandardStandard","title":"Standard","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The standard dropzone is used to drop files dragged from outside the browser window. The dropped files are presented to the user and can be uploaded to the server.","composition":"Standard dropzones consist of a visible area where files can be dropped. They MUST contain a message explaining that it is possible to drop files inside. The dropped files are presented to the user, optionally with some button to start the upload process.","effect":"A standard dropzone is highlighted when the user is dragging files over the dropzone. After dropping, the dropped files are presented to the user with some meta information of the files such the file name and file size.","rivals":{"Rival 1":"A wrapper dropzone can hold other ILIAS UI components instead of a message."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Standard dropzones MUST contain a message.","2":"The upload button MUST be disabled if there are no files to be uploaded. Only true if the dropzone is NOT used in a form containing other form elements.","3":"Standard dropzones MAY be used in forms."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"Standard dropzones MUST offer the possibility to select files manually from the computer."}},"parent":"DropzoneFileFactoryFile","children":[],"less_variables":[],"path":"src\/UI\/Component\/Dropzone\/File\/Standard"},"DropzoneFileWrapperWrapper":{"id":"DropzoneFileWrapperWrapper","title":"Wrapper","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"A wrapper dropzone is used to display other ILIAS UI components inside it. In contrast to the standard dropzone, the wrapper dropzone is not visible by default. Only the wrapped components are visible. Any wrapper dropzone gets highlighted once the user is dragging files over the browser window. Thus, a user needs to have the knowledge that there are wrapper dropzones present. They can be introduced to offer additional approaches to complete some workflow more conveniently. Especially in situation where space is scarce such as appointments in the calendar.","composition":"A wrapper dropzone contains one or multiple ILIAS UI components. A roundtrip modal is used to present the dropped files and to initialize the upload process.","effect":"All wrapper dropzones on the page are highlighted when the user dragging files over the browser window. After dropping the files, the roundtrip modal is opened showing all files. The modal contains a button to start the upload process.","rivals":{"Rival 1":"A standard dropzone displays a message instead of other ILIAS UI components."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Most pages SHOULD NOT contain a wrapper dropzone. Whenever you want to introduce a new usage of the Wrapper-Dropzone, propose it to the Jour Fixe.","2":"Wrapper dropzones MUST contain one or more ILIAS UI components.","3":"Wrapper dropzones MUST NOT contain any other file dropzones.","4":"Wrapper dropzones MUST NOT be used in modals.","5":"The upload button in the modal MUST be disabled if there are no files to be uploaded."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"DropzoneFileFactoryFile","children":[],"less_variables":[],"path":"src\/UI\/Component\/Dropzone\/File\/Wrapper"},"TablePresentationPresentation":{"id":"TablePresentationPresentation","title":"Presentation","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The Presentation Table lists some tabular data in a pleasant way. The user can get a quick overview over the records in the dataset, the Presentation Table only shows the most relevant fields of the records at first glance. The records can be expanded to show more extensive information, i.e. additional fields and further information. The Presentation Table represents the displayed dataset an entirety rather than a list of single rows. The table facilitates exploring the dataset, where the purpose of this exploration is known and supported. Single records may be derived and composed from all kind of sources and do not necessarily reference a persistent entity like an ilObject.","composition":"The Presentation Table consists of a title, a slot for View Controls and Presentation Rows. The rows will be prefixed by an Expand Glyph and consist of a headline, a subheadline and a choice of record-fields. The expanded row will show a lists of further fields and, optionally, a button or dropdown for actions. The table is visually represented as a wholeness and does not decompose into several parts.","effect":"Rows can be expanded and collapsed to show\/hide more extensive and detailed information per record. A click on the Expand Glyph will enlarge the row vertically to show the complete record and exchange the Expand Glyph by a Collapse Glyph. Fields that were shown in the collapsed row will be hidden except for headline and subheadline. The ordering among the records in the table, the ordering of the fields in one row or the visible contents of the table itself can be adjusted with View Controls. In contrast to the accordions known from the page editor, it is possible to have multiple expanded rows in the table.","rivals":{"Data Table":"A data-table shows some dataset and offers tools to explore it in a user defined way. Instead of aiming at simplicity the Presentation Table aims at maximum explorability. Datasets that contain long content fields, e.g. free text or images, are hard to fit into a Data Table but can indeed be displayed in a Presentation Table.","Listing Panel":"Listing Panels list items, where an item is a unique entity in the system, i.e. an identifyable, persistently stored object. This is not necessarily the case for Presentation Tables, where records can be composed of any data from any source in the system."}},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"Rows in the table MUST be of the same structure."},"composition":[],"interaction":{"1":"View Controls used here MUST only affect the table itself.","2":"Clicking the Expand Glyph MUST only expand the row. It MUST NOT trigger any other action."},"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":{"1":"The expandable content, especially the contained buttons, MUST be accessible by only using the keyboard."}},"parent":"TableFactoryTable","children":[],"less_variables":[],"path":"src\/UI\/Component\/Table\/Presentation"},"MessageBoxMessageBoxFailure":{"id":"MessageBoxMessageBoxFailure","title":"Failure","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The system failed to complete some actions and displays information about the failure.","composition":"The alert-danger style is used for the message.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"The Failure Message Boxes MUST be used, if a user interaction has failed.","2":"The message SHOULD inform the user why the interaction has failed.","3":"The message SHOULD inform the user how to the problem can be fixed."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"MessageBoxFactoryMessageBox","children":[],"less_variables":[],"path":"src\/UI\/Component\/MessageBox\/MessageBox"},"MessageBoxMessageBoxSuccess":{"id":"MessageBoxMessageBoxSuccess","title":"Success","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The system succeeded in finishing some action and displays a success message.","composition":"The alert-success style is used for the message.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"The Success Message Boxes MUST be used, if a user interaction has successfully ended.","2":"The message SHOULD summarize how the system state has been changed due to the user interaction."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"MessageBoxFactoryMessageBox","children":[],"less_variables":[],"path":"src\/UI\/Component\/MessageBox\/MessageBox"},"MessageBoxMessageBoxInfo":{"id":"MessageBoxMessageBoxInfo","title":"Info","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The system informs the user about obstacles standing in the way of completing a workflow or about side-effects of his or her actions on other users.","composition":"The alert-info style is used for the message.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"The Info Message Boxes MAY be used to describe a state or condition of the system that help the user to understand the interactions provided on or missing from a screen.","2":"The Info Message Boxes MUST NOT be used at the end of a user interaction. Instead Success or Failure Message Boxes SHOULD be used."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"MessageBoxFactoryMessageBox","children":[],"less_variables":[],"path":"src\/UI\/Component\/MessageBox\/MessageBox"},"MessageBoxMessageBoxConfirmation":{"id":"MessageBoxMessageBoxConfirmation","title":"Confirmation","abstract":0,"status_entry":"Proposed","status_implementation":"Partly implemented","description":{"purpose":"The system makes sure that an action should really be performed.","composition":"The alert-warning style is used for the message.","effect":"","rivals":[]},"background":"","context":[],"selector":"","feature_wiki_references ":[],"rules":{"usage":{"1":"The Confirmation Message Boxes MUST be used, if a deletion interaction is being processed. The Buttons MUST provide a confirm and a cancel option."},"composition":[],"interaction":[],"wording":[],"ordering":[],"style":[],"responsiveness":[],"accessibility":[]},"parent":"MessageBoxFactoryMessageBox","children":[],"less_variables":[],"path":"src\/UI\/Component\/MessageBox\/MessageBox"}}